// Пересчитывает Сумму ИзВалюты ВВалюту
//
Функция Пересчитать2025(Сумма, ВалютаИз, ВалютаВ, Фирма, НаДату = 0) Экспорт

	//Фирма = гоФирма();	
	ВалютаРубль = омСервер.ПолучитьВалюту("руб");  // гоПараметрСеанса("валюта")
	ВалютаДоллар = омСервер.ПолучитьВалюту("USD"); // гоПараметрСеанса("БазоваяВалюта")
	
	БазИз = ?(ЗначениеЗаполнено(ВалютаИз.БазоваяВалюта), 
						ВалютаИз.БазоваяВалюта,
						Фирма.Валюта);
	БазВ = ?(ЗначениеЗаполнено(ВалютаВ.БазоваяВалюта), 
						ВалютаВ.БазоваяВалюта,
						Фирма.Валюта);  
						
	Если ВалютаИз = ВалютаВ Тогда
		
		к = 1;
		
	ИначеЕсли ВалютаИз = ВалютаДоллар И ВалютаВ = ВалютаРубль Тогда
		
		к = Курс(ВалютаИз, НаДату, Фирма);
		
	ИначеЕсли ВалютаИз = ВалютаРубль И ВалютаВ = ВалютаДоллар Тогда
		
		к = 1 / Курс(ВалютаВ, НаДату, Фирма);
		
	// 1 без кросс-курса
	
	ИначеЕсли БазИз	= ВалютаДоллар И ВалютаВ = ВалютаДоллар Тогда 
		
		к = Курс(ВалютаИз, НаДату, Фирма);
		Если ВалютаИз.ОбратныйКурс Тогда
			 к = 1 / к;
		КонецЕсли;
		
	ИначеЕсли БазВ = ВалютаДоллар И ВалютаИз = ВалютаДоллар Тогда 
		
		к = 1 / Курс(ВалютаВ, НаДату, Фирма);
		Если ВалютаВ.ОбратныйКурс Тогда
			 к = 1 / к;
		КонецЕсли;
		
	ИначеЕсли БазИз	= ВалютаРубль И ВалютаВ = ВалютаРубль Тогда 
		
		к = Курс(ВалютаИз, НаДату, Фирма);
		Если ВалютаИз.ОбратныйКурс Тогда
			 к = 1 / к;
		КонецЕсли;
		
	ИначеЕсли БазВ = ВалютаРубль И ВалютаИз = ВалютаРубль Тогда 
		
		к = 1 / Курс(ВалютаВ, НаДату, Фирма);
		Если ВалютаВ.ОбратныйКурс Тогда
			 к = 1 / к;
		КонецЕсли;
		
	// 2 с кросс-курсом
	
	ИначеЕсли БазИз	= БазВ Тогда 
		
		к1 = Курс(ВалютаИз, НаДату, Фирма);
		Если ВалютаИз.ОбратныйКурс Тогда
			 к1 = 1 / к1;
		КонецЕсли;
		к2 = Курс(ВалютаВ, НаДату, Фирма);
		Если ВалютаВ.ОбратныйКурс Тогда
			 к2 = 1 / к2;
		КонецЕсли;
		к = к1 * к2;
		
	// 3 через 2 валюты
	
	ИначеЕсли БазИз = ВалютаДоллар Тогда
	
		к1 = Курс(ВалютаИз, НаДату, Фирма);
		Если ВалютаИз.ОбратныйКурс Тогда
			к1 = 1 / к1;
		КонецЕсли;
		к2 = Курс(ВалютаВ, НаДату, Фирма);
		Если ВалютаВ.ОбратныйКурс Тогда
			к2 = 1 / к2;
		КонецЕсли;   
		к3 = Курс(БазИз, НаДату, Фирма);	
	    к = к1 / к2 * к3;
	
	ИначеЕсли БазВ = ВалютаДоллар Тогда

		к1 = Курс(ВалютаИз, НаДату, Фирма);
		Если ВалютаИз.ОбратныйКурс Тогда
			к1 = 1 / к1;
		КонецЕсли;
		к2 = Курс(ВалютаВ, НаДату, Фирма);
		Если ВалютаВ.ОбратныйКурс Тогда
			к2 = 1 / к2;
		КонецЕсли;   
		к3 = Курс(БазВ, НаДату, Фирма);	
	    к = к1 / к2 / к3;

	КонецЕсли;
	

	Результат = к * Сумма;

	
	Возврат Результат;
	
КонецФункции 


Функция Курс(знач Валюта, НаДату = 0, Фирма)  
	
	Если Валюта.Код = "РУБ" Тогда
		Валюта = ПараметрыСеанса.БазоваяВалюта;
	КонецЕсли;   
	
	Струк = Новый Структура("Фирма, Валюта", Фирма, Валюта);
	
	Если НаДату = 0 Тогда
		РезСтрук = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(, Струк);
	Иначе
		РезСтрук = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(НаДату, Струк);
	КонецЕсли; 
	
	Курс = РезСтрук.Курс;
	Если Курс = 0 Тогда
		Курс = 1;
	КонецЕсли;

	Возврат Курс;
	
КонецФункции

