&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Тек = ПараметрКоманды;
	Если гоПЗ(Тек) Тогда Возврат КонецЕсли; 
	
	  
	Если клНетДа(НСтр("ru = 'Проверить наличие ссылок?'; en = 'Check for links?'") + гоРС() + НСтр("ru = 'Операция может быть очень долгой!'; en = 'The operation can be too long!'")) Тогда Возврат КонецЕсли; 
	
	Т = Новый ТекстовыйДокумент;
	Сче = омСервер.ЧислоСсылок(Тек, Т);
	Если Сче = 0 Тогда клВнимание( НСтр("ru = 'Нет ссылок!'; en = 'No links!'")); Возврат; КонецЕсли; 
	
	Если клНетДа(СтрШаблон(НСтр("ru = 'Есть ссылки: %1! %2Показать?'; en = 'There are links: %1! %2Show?'"),Сче,гоРС()), , Истина) Тогда Возврат КонецЕсли; 
	
	Т.Показать(НСтр("ru = 'Ссылки'; en = 'Links'"));
КонецПроцедуры
