
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр РасходыДоходы 
	Движения.РасходыДоходы.Записывать = Истина;
	Движения.РасходыДоходы.Очистить();
	

	Движение = Движения.РасходыДоходы.Добавить();
	Движение.Период = Дата;
	Движение.Фирма = Фирма;
	Движение.Вид = ПредопределенноеЗначение("Перечисление.ДоходРасход.Расход");
	Движение.Статья = Справочники.Статьи.НайтиПоКоду("42");;
	Движение.Валюта = Справочники.Валюты.НайтиПоКоду("руб");
	Движение.Сумма = СуммаВРублях;
	
	Движение  = Движения.РасходыДоходы.Добавить();
	Движение.Период = Дата;
	Движение.Фирма = Фирма;
	Движение.Вид = ПредопределенноеЗначение("Перечисление.ДоходРасход.Расход");
	Движение.Статья = Справочники.Статьи.НайтиПоКоду("42");;
	Движение.Валюта = Справочники.Валюты.НайтиПоКоду("usd");
	Движение.Сумма = СуммаВДолларах;
 

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если глЗапретЗаписиПоДате(Ссылка) Тогда Отказ = Истина; Возврат; КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Фирма) Тогда Фирма = гоФирма() КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(КемСоздан) Тогда КемСоздан = гоПользователь() КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(Создан) Тогда Создан = ТекущаяДата() КонецЕсли; 
	КемСохранен = гоПользователь();
	Сохранен = ТекущаяДата();

КонецПроцедуры


Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	Префикс = глПрефиксДефис(Фирма);

КонецПроцедуры

