&НаКлиенте
Процедура МояСформировать(Команда)
	клПроверитьУстановитьПараметрОтчета(Отчет, "ВалютаПересчета", гоРеквизит(гоФирма(), "Валюта"));
	
	СкомпоноватьРезультат(РежимКомпоновкиРезультата.Авто);
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
//2017.03.24
	Если ЭтаФорма.ПредставлениеТекущегоВарианта = "Расшифровка" Тогда Возврат КонецЕсли;
	
	Мас = омСервер.МассивСкладов();
	Если Мас.Количество() = 0 Тогда 
		гоУстановитьПараметр(ЭтаФорма.Отчет, "Склад", , Истина);
	Иначе 
		гоУстановитьПараметр(ЭтаФорма.Отчет, "Склады", Мас);
	КонецЕсли; 
	
	ЭтаФорма.ВариантМодифицирован = Ложь;
КонецПроцедуры
