// © Primus1C  26.06.2023  НАЧАЛО ►

#Область ДействияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ИмяДокумента = "Инвойс";

	гоСтандартныйОтборПоПолю("Контрагенты", Список, "Контрагент");
	
	глПокраситьВалюты(ЭтаФорма, "Валюта");  
	//глПокраситьСтатусы(ЭтаФорма, "Список", Истина, Ложь, Ложь);  
	лРаскраскаСтатусов =  ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("РаскрашиватьСтатусыВФормеСписка");
	глПокраситьСтатусы(ЭтаФорма, "Список", лРаскраскаСтатусов, , лРаскраскаСтатусов);  
    //глПокраситьПомеченныеНаУдаление(ЭтаФорма);
	глУстановитьГраницуВидимости(Список);
	
	Если Элементы.Найти("КоличествоСообщений") <> Неопределено Тогда
		Элементы.КоличествоСообщений.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьСообщения");
	КонецЕсли;
	
    Элементы.Примечание.Видимость = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОтображатьПримечаниеТекущегоДокументаВнизуСписка");
	
	СтруктураПечатныхФорм = Документы._Инвойс.ПолучитьСтруктуруПечатныхФорм();  
	ПараметрыРазмещения = Новый Структура("Форма, ЭтоФормаОбъекта, КоманднаяПанель", ЭтаФорма, Ложь, Неопределено);
	ОбщегоНазначенияСервер.ПодключитьКомандыПечати(ПараметрыРазмещения, СтруктураПечатныхФорм);   

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	

КонецПроцедуры
	
#КонецОбласти         


#Область ДействияЭлементовФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле.Имя = "Вложения" Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура("ВладелецСсылка, НазначениеФайла, ИмяАктивнойГиперссылки, ДобавлениеФайла", 
									СтруктураОснования(ВыбраннаяСтрока).Владелец, 
									ПредопределенноеЗначение("Перечисление.НазначениеФайлов.Прочее"),
									"Файл_П0",
									Неопределено);
		ОткрытьФорму("Обработка.Предпросмотр.Форма.ФормаПредпросмотра", ПараметрыФормы, ЭтаФорма,,,, );
	Иначе		
	
	КонецЕсли;

КонецПроцедуры

//&НаКлиенте
//Процедура ВывестиПримечание(Команда)  
//	
//	Элементы.Примечание.Видимость 	= ОтображатьПримечание;
//	ОтображатьПримечание 			= НЕ ОтображатьПримечание; 
//	
//КонецПроцедуры

#КонецОбласти  


&НаСервереБезКонтекста
Функция СтруктураОснования(ИнвойсСсылка)
	
	лОснование = ИнвойсСсылка.ДокументОснование;
	Возврат Новый Структура("ОбъектУИД,Владелец", лОснование.УникальныйИдентификатор(), лОснование);	

КонецФункции 

&НаСервере
Процедура УстановитьСтатусНаСервере(ИнвойсСсылка, НовСтатус)

	ОбщегоНазначенияСервер.ЗаписатьСтатусыИнвойса(ИнвойсСсылка, НовСтатус, , , , "Форма списка");

КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатус(Команда) 

	Спис = Новый СписокЗначений;
	Спис.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыИнвойса.ВПути"),,,БиблиотекаКартинок.ИндикаторЖелтый16);
	Спис.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыИнвойса.ЧастичноПрибыл"),,,БиблиотекаКартинок.ИндикаторЖелтый16);
	Спис.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыИнвойса.Прибыл"),,,БиблиотекаКартинок.ИндикаторЗеленый16);
	ВыбСтатус = ВыбратьИзМеню(Спис, ЭтаФорма.ТекущийЭлемент);
	Если ВыбСтатус <> Неопределено Тогда
		УстановитьСтатусНаСервере(ЭтаФорма.Элементы.Список.ТекущаяСтрока, ВыбСтатус.Значение); 
		Элементы.Список.Обновить();
	КонецЕсли;

КонецПроцедуры


#Область ПримечаниеТекущегоДокументаАсихрон

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	//Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
	//	Элементы.Примечание.Заголовок = "";
	//Иначе                                
	//	//	Элементы.Примечание.Заголовок = Примечание(Элементы.Список.ТекущаяСтрока);  // это синхрон
	//	ДопПараметры = Элементы.Список.ТекущаяСтрока;
	//	ОписаниеОповещения = Новый ОписаниеОповещения("ПолучениеДанныхДокументаЗавершение", ЭтотОбъект, ДопПараметры);
	//	НачатьПолучениеДанныхДокумента(ОписаниеОповещения);
	//КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НачатьПолучениеДанныхДокумента(ОписаниеОповещения) Экспорт

	ВыполнитьОбработкуОповещения(ОписаниеОповещения, Истина);	

КонецПроцедуры

&НаКлиенте
Процедура ПолучениеДанныхДокументаЗавершение(ФормаВызова, ДопПараметры) Экспорт
	
	//Элементы.Примечание.Заголовок = Примечание(ДопПараметры);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция Примечание(ДокСсылка)
	
	Возврат ДокСсылка.Примечание;

КонецФункции 

#КонецОбласти



#Область ПодключаемаяПечать
	
&НаКлиенте
Процедура ВыполнитьПодключеннуюПечать(Команда)
	
	ВариантПечатнойФормы = СтрЗаменить(Команда.Имя, "ПодключеннаяПечать_", "");   
	ТабДок = ПечатнаяФорма(ВариантПечатнойФормы);
	ПараметрыПечати = Новый Структура("Таб, Имя, НеДляПечати", ТабДок, гоИмя(ТекущийЭлемент.ТекущаяСтрока, Ложь), Ложь);
	ОткрытьФорму("ОбщаяФорма.ПечатьБезЗащиты", ПараметрыПечати, , Истина); 
		
КонецПроцедуры  

&НаСервере
Функция ПечатнаяФорма(ВариантПечатнойФормы)

	ТабДок = Новый ТабличныйДокумент;
	Документы._Инвойс.ПечатьДокумента(ТекущийЭлемент.ТекущаяСтрока, ВариантПечатнойФормы, ТабДок);
	Возврат ТабДок;
	
КонецФункции 

#КонецОбласти 

// © Primus1C  ОКОНЧАНИЕ ◄ 
