Процедура ЗаполнитьРеквизиты(Форма) Экспорт
	Форма.ИмяЖурнала = "Движения денег";
КонецПроцедуры

Процедура УстановитьВсеПараметры(Форма) Экспорт
КонецПроцедуры

Процедура ПечатьДокумента(Тек, Поз, Таб, Параметры = 0) Экспорт
КонецПроцедуры

// © Primus1C  24.05.2025  НАЧАЛО ► 

Процедура УстановитьКурсовуюРазницу(ДокументОбъект, ПоКурсуПользователя = Ложь) Экспорт
	
	Если ДокументОбъект.СубДВалюта.ВестиПартионныйУчет И ДокументОбъект.СубДСчет.ВестиПартионныйУчет И ДокументОбъект.РассчитыватьСреднийКурс Тогда
		ДокументОбъект.СуммаКР = 0;
		Возврат;
	КонецЕсли;
	
	БазоваяВалютаФирмы = ДокументОбъект.Фирма.Валюта; // руб
	Если ДокументОбъект.Валюта = ДокументОбъект.СубДВалюта Тогда
		лКурс = 1;	  
		
	ИначеЕсли ДокументОбъект.Валюта	= БазоваяВалютаФирмы Тогда 
		лКурс = омСервер.Курс(ДокументОбъект.СубДВалюта, ДокументОбъект.Фирма, ДокументОбъект.Дата); 
		ДокументОбъект.СубДОбратный = Истина;   
		
	ИначеЕсли ДокументОбъект.СубДВалюта	= БазоваяВалютаФирмы Тогда
		лКурс = омСервер.Курс(ДокументОбъект.Валюта, ДокументОбъект.Фирма, ДокументОбъект.Дата); 
		ДокументОбъект.СубДОбратный = Ложь;   

	ИначеЕсли ДокументОбъект.СубДВалюта.БазоваяВалюта = ДокументОбъект.Валюта Тогда // пересчет покупаемой валюты в ее базовую 
		Если ДокументОбъект.СубДВалюта.ВестиПартионныйУчет И ДокументОбъект.СубДСчет.ВестиПартионныйУчет Тогда
			лКурс = омСервер.Курс(ДокументОбъект.СубДВалюта, ДокументОбъект.Фирма, ДокументОбъект.Дата, "закупка");
		Иначе
			лКурс = омСервер.Курс(ДокументОбъект.СубДВалюта, ДокументОбъект.Фирма, ДокументОбъект.Дата);
		КонецЕсли;
		//Если ДокументОбъект.СубДВалюта.ОбратныйКурс Тогда
		//	лКурс = 1 / лКурс;	
		//КонецЕсли;         
		ДокументОбъект.СубДОбратный = НЕ ДокументОбъект.СубДВалюта.ОбратныйКурс;     
		
	ИначеЕсли ДокументОбъект.Валюта.БазоваяВалюта = ДокументОбъект.СубДВалюта Тогда //
		лКурс = омСервер.Курс(ДокументОбъект.Валюта, ДокументОбъект.Фирма, ДокументОбъект.Дата);
		ДокументОбъект.СубДОбратный = ДокументОбъект.Валюта.ОбратныйКурс; 
		
	Иначе // кросс-курс
		Кур1 = омСервер.Курс(ДокументОбъект.Валюта, 	ДокументОбъект.Фирма, ДокументОбъект.Дата);
		Кур2 = омСервер.Курс(ДокументОбъект.СубДВалюта, ДокументОбъект.Фирма, ДокументОбъект.Дата);
		Если Кур1 < Кур2 Тогда
			лКурс = Окр(Кур2 / Кур1, 5);
			ДокументОбъект.СубДОбратный = Истина;
		Иначе
			лКурс = Окр(Кур1 / Кур2, 5);
			ДокументОбъект.СубДОбратный = Ложь;
		КонецЕсли;    
			
	КонецЕсли;    
	
	лКурсЭталон = лКурс;
	Если ПоКурсуПользователя Тогда 
		лКурс = ДокументОбъект.СубДКурс; 
	Иначе	
		ДокументОбъект.СубДКурс = лКурс;
	КонецЕсли;
	
	Если ДокументОбъект.СубДОбратный Тогда
		ДокументОбъект.СубДСумма = Окр(ДокументОбъект.Сумма / лКурс, 2);
		СуммаЭталон = Окр(ДокументОбъект.СубДСумма * лКурсЭталон, 2);
	Иначе
		ДокументОбъект.СубДСумма = Окр(ДокументОбъект.Сумма * лКурс, 2);
		СуммаЭталон = Окр(ДокументОбъект.СубДСумма / лКурсЭталон, 2);
	КонецЕсли;
	
	ДокументОбъект.СуммаКР = СуммаЭталон - ДокументОбъект.Сумма;

КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄