
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Выполнена Тогда
		Элементы.ФормаВыполнитьИЗакрыть.Доступность = Ложь;	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьКэшТэгов();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКэшТэгов() 
	
	КэшТэгов.Очистить();
	МасТэговЭтойЗадачи = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Объект.Тэги, ",");
	Запр = Новый Запрос;
	Запр.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	Задача.Тэги КАК Тэги
	             |ИЗ
	             |	Задача.Задача КАК Задача
	             |ГДЕ
	             |	Задача.Тэги <> """"";
    Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		мас = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Выборка.Тэги, ",");
		Для каждого Эл Из мас Цикл
			тэг = СокрЛП(Эл);
			Если КэшТэгов.НайтиПоЗначению(тэг) = Неопределено Тогда
				КэшТэгов.Добавить(тэг, тэг, МасТэговЭтойЗадачи.Найти(тэг) <> Неопределено);
			КонецЕсли;			
		КонецЦикла;
	КонецЦикла;
              	
КонецПроцедуры	

&НаКлиенте
Процедура ТэгиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//ВыбратьИзСписка(КэшТэгов, Элементы.Тэги);

    Оповещение = Новый ОписаниеОповещения("ПослеОтметкиЭлементов", ЭтотОбъект);
	КэшТэгов.ПоказатьОтметкуЭлементов(Оповещение, "Тэги");

КонецПроцедуры

&НаКлиенте
Процедура ПослеОтметкиЭлементов(Список, Параметры) Экспорт 
	
	Если Список <> Неопределено Тогда
		Объект.Тэги = "";
        Для каждого Элемент из Список Цикл
			Если Элемент.Пометка Тогда 
				Если Объект.Тэги <> "" Тогда
					Объект.Тэги = Объект.Тэги + ", ";
				КонецЕсли; 
				Объект.Тэги = Объект.Тэги + Элемент.Значение;
            КонецЕсли;
		КонецЦикла;
		Модифицированность = Истина;
	КонецЕсли; 
	
КонецПроцедуры