Процедура ПроверитьВозможностьПроведения(Отказ)
	
	Если НЕ ЗначениеЗаполнено(ВидОперации) Тогда
		Сообщить("Не заполнен вид операции");
		Отказ = Истина;
	КонецЕсли; 
	
	Для каждого СтрокаТЧ Из Товары Цикл 
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
			Сообщить("Не заполнена номенклатура в строке " + СтрокаТЧ.НомерСтроки);
			Отказ = Истина;
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Партия) Тогда
			Сообщить("Не заполнена партия в строке " + СтрокаТЧ.НомерСтроки);
			Отказ = Истина;
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Серия) Тогда
			Сообщить("Не заполнена серия в строке " + СтрокаТЧ.НомерСтроки);
			Отказ = Истина;
		КонецЕсли;	
		
		Если ВидОперации = Перечисления.ВидыОперацииЗаменаСерий.ЗаменаНоменклатурыВОднойСерии Тогда
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.НоменклатураНовая) Тогда
				Сообщить("Не заполнена новая номенклатура в строке " + СтрокаТЧ.НомерСтроки);
				Отказ = Истина;
			КонецЕсли;	
		Иначе
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.СерияНовая) Тогда
				Сообщить("Не заполнена новая серия в строке " + СтрокаТЧ.НомерСтроки);
				Отказ = Истина;
			КонецЕсли;	
		КонецЕсли; 
		
	КонецЦикла;	

КонецПроцедуры
  
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроверитьВозможностьПроведения(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацииЗаменаСерий.ЗаменаСерийОднойНоменклатуры Тогда
		
		Запр = Новый Запрос;
		Запр.УстановитьПараметр("Дата", Дата);
		Запр.УстановитьПараметр("Ссылка", Ссылка);
		Запр.Текст = "ВЫБРАТЬ
		             |	Рег.Партия КАК Партия,
		             |	Рег.Партия.Серия КАК Серия,
		             |	ТЧТовары.СерияНовая КАК СерияНовая,
		             |	Рег.ОстатокОстаток КАК Остаток,
		             |	ТЧТовары.Партия.Владелец КАК Номенклатура
		             |ИЗ
		             |	(ВЫБРАТЬ
		             |		Товары.Партия КАК Партия,
		             |		Товары.Серия КАК Серия,
		             |		Товары.СерияНовая КАК СерияНовая
		             |	ИЗ
		             |		Документ.ЗаменаСерий.Товары КАК Товары
		             |	ГДЕ
		             |		Товары.Ссылка = &Ссылка) КАК ТЧТовары
		             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТовара.Остатки(&Дата, ) КАК Рег
		             |		ПО ТЧТовары.Партия = Рег.Партия
		             |			И ТЧТовары.Серия = Рег.Партия.Серия";
		Выборка = Запр.Выполнить().Выбрать();	
		Пока Выборка.Следующий() Цикл
			Если Выборка.Остаток <= 0 Тогда 
				Сообщить("Нет остатков серии " + Выборка.Серия);
			 	Отказ = Истина;
			КонецЕсли;
		КонецЦикла;

		Если НЕ Отказ Тогда
			Выборка.Сбросить();
			Пока Выборка.Следующий() Цикл	
				ПартияОбъект = Выборка.Партия.ПолучитьОбъект();
				ПартияОбъект.Серия = Выборка.СерияНовая;
				гоЗаписьЖурналаРегистрации(СтрШаблон("Замена серии %1: %2 -> %3", Выборка.Номенклатура, Выборка.Серия, Выборка.СерияНовая), , "Проведение", Выборка.Партия, ); 
				ПартияОбъект.Записать(); 
			КонецЦикла;
		КонецЕсли;
		
	Иначе
	
		
	
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если ВидОперации = Перечисления.ВидыОперацииЗаменаСерий.ЗаменаСерийОднойНоменклатуры Тогда       
		
		Запр = Новый Запрос;
		Запр.УстановитьПараметр("Дата", Дата);
		Запр.УстановитьПараметр("Ссылка", Ссылка);
		Запр.Текст = "ВЫБРАТЬ
		             |	Рег.Партия КАК Партия,
		             |	Рег.Партия.Серия КАК Серия,
		             |	ТЧТовары.СерияНовая КАК СерияНовая,
		             |	Рег.ОстатокОстаток КАК Остаток,
		             |	ТЧТовары.Партия.Владелец КАК Номенклатура
		             |ИЗ
		             |	(ВЫБРАТЬ
		             |		Товары.Партия КАК Партия,
		             |		Товары.Серия КАК Серия,
		             |		Товары.СерияНовая КАК СерияНовая
		             |	ИЗ
		             |		Документ.ЗаменаСерий.Товары КАК Товары
		             |	ГДЕ
		             |		Товары.Ссылка = &Ссылка) КАК ТЧТовары
		             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТовара.Остатки(&Дата, ) КАК Рег
		             |		ПО ТЧТовары.Партия = Рег.Партия
		             |			И ТЧТовары.СерияНовая = Рег.Партия.Серия";
		Выборка = Запр.Выполнить().Выбрать();	
		Пока Выборка.Следующий() Цикл
			Если Выборка.Остаток <= 0 Тогда 
				Сообщить("Нет остатков серии " + Выборка.СерияНовая);
			 	Отказ = Истина;
			КонецЕсли;
		КонецЦикла;

		Если НЕ Отказ Тогда
			Выборка.Сбросить();
			Пока Выборка.Следующий() Цикл	
				ПартияОбъект = Выборка.Партия.ПолучитьОбъект();
				ПартияОбъект.Серия = Выборка.Серия;
				гоЗаписьЖурналаРегистрации(СтрШаблон("Замена серии %1: %2 -> %3", Выборка.Номенклатура, Выборка.Серия, Выборка.СерияНовая), , "Отмена проведения", Выборка.Партия, ); 
				ПартияОбъект.Записать(); 
			КонецЦикла;
		КонецЕсли;
		
	Иначе
	
		
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(КемСоздан) Тогда КемСоздан = гоПользователь() КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(Создан) Тогда Создан = ТекущаяДата() КонецЕсли; 
	КемСохранен = гоПользователь();
	Сохранен = ТекущаяДата();

КонецПроцедуры
