
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

    омСервер.ЗаписатьОбщиеРеквизиты(ЭтотОбъект);
    Количество = Товары.Итог("Количество");
	Сумма = Товары.Итог("Сумма");
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ОбщегоНазначенияСервер.ЗаполнитьРеквизитыДокументаПоУмолчанию(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ТаблицаТовары = ТаблицаТовары();
	ПроверкаВозможностиПроведения(ТаблицаТовары, Отказ);

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Движения.ОстаткиТовара.Записывать = Истина;
	Движения.ТоварыНаКомиссии.Записывать = Истина;
	
	Для Каждого ТекСтрокаТовары Из ТаблицаТовары Цикл  
		
		// РН ОстаткиТовара
		Движение = Движения.ОстаткиТовара.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
		Движение.Период 		= Дата;
		Движение.Номенклатура 	= ТекСтрокаТовары.Номенклатура;
		Движение.Партия 		= ТекСтрокаТовары.Партия;
		Движение.Склад 			= Склад;
		Движение.Фирма 			= Фирма;
		Движение.Остаток 		= ТекСтрокаТовары.Количество; 

		Движение = Движения.ОстаткиТовара.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
		Движение.Период 		= Дата;
		Движение.Номенклатура 	= ТекСтрокаТовары.Номенклатура;
		Движение.Партия 		= ТекСтрокаТовары.Партия;
		Движение.Склад 			= СкладКомиссии;
		Движение.Фирма 			= Фирма;
		Движение.Остаток 		= ТекСтрокаТовары.Количество; 
		
		// РН ТоварыНаКомиссии
		Движение = Движения.ТоварыНаКомиссии.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход; 
		Движение.Период 		= Дата;
 		Движение.Номенклатура 	= ТекСтрокаТовары.Номенклатура;
		Движение.Партия 		= ТекСтрокаТовары.Партия;
		Движение.Контрагент 	= Контрагент;
		Движение.Склад 			= СкладКомиссии;
        Движение.Количество		= ТекСтрокаТовары.Количество;
        Движение.Сумма			= ТекСтрокаТовары.Сумма;
		
	КонецЦикла;

	
КонецПроцедуры

Процедура ПроверкаВозможностиПроведения(ТаблицаТовары, Отказ)
	
	Ошибки = Новый СписокЗначений;
	
	// Запрет незаполненных установлен в свойствах реквизитов шапки
	//ПроведениеДокументов.ПроверитьЗаполнениеРеквизитов(ЭтотОбъект, "Контрагент,Склад,СкладКомиссии,Валюта", Отказ); 
	
	ПроведениеДокументов.ПроверитьНаТолькоТовары(ТаблицаТовары, Ошибки);
	ПроведениеДокументов.ПроверитьНаОстаткиТоваров(ТаблицаТовары, МоментВремени(), Склад, Ошибки, Фирма);
		
	
	Для каждого Ош Из Ошибки Цикл
		Отказ = Истина;
		Сообщить(Ош.Значение);
	КонецЦикла; 
	
КонецПроцедуры

Функция ТаблицаТовары()

	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("Номенклатура",			"Номенклатура");
	СтруктураПолей.Вставить("ТипНоменклатуры",		"Номенклатура.ТипНоменклатуры");
	СтруктураПолей.Вставить("ЗапретОтгрузки",		"Номенклатура.ЗапретОтгрузки");
	СтруктураПолей.Вставить("Серия",				"Серия");
	СтруктураПолей.Вставить("Партия",				"Партия");
	СтруктураПолей.Вставить("Количество",			"Количество");
	СтруктураПолей.Вставить("ЦенаЗакупки",			"ЦенаЗакупки");
	СтруктураПолей.Вставить("ЦенаЗакупкиСЗатратами","ЦенаЗакупкиСЗатратами");
	СтруктураПолей.Вставить("ЦенаКомитента",		"ЦенаКомитента");
	СтруктураПолей.Вставить("Сумма",				"Сумма");   
	
	ЗапросТовары = ПроведениеДокументов.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураПолей);
	ТаблицаТовары = ЗапросТовары.Выгрузить();
	
    Возврат ТаблицаТовары;
	
КонецФункции 

