
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	// 1. Получаем текст макета
	ИмяМакета = "ОсновнаяСхемаКомпоновкиДанных";
	СхемаКомпоновкиДанных = ПолучитьМакет(ИмяМакета);
	Настройки = КомпоновщикНастроек.Настройки;
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	// 2. Создаем таблицу для СКД
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("Объект", 	ТипСсылка());
	ТаблицаДанных.Колонки.Добавить("Задача", 	Новый ОписаниеТипов("Строка"));
	ТаблицаДанных.Колонки.Добавить("Приоритет", Новый ОписаниеТипов("Число"));
	//ТаблицаДанных.Колонки.Добавить("Описание");
	
	ЗаполнитьТаблицуДанных(ТаблицаДанных);
	
	//// Алгоритм разбора строк (условно, если в макете разделитель "|")
	//Для НомерСтроки = 1 По СтрЧислоСтрок(МакетТекст) Цикл
	//    ТекСтрока = СтрПолучитьСтроку(МакетТекст, НомерСтроки);
	//    // Пример парсинга: Дата | Заказчик | Тэги | Описание
	//    Части = СтрРазделить(ТекСтрока, "|");
	//    Если Части.Количество() >= 4 Тогда
	//        НоваяСтрока = ТаблицаДанных.Добавить();
	//        НоваяСтрока.Дата     = Дата(СокрЛП(Части[0]));
	//        НоваяСтрока.Заказчик = СокрЛП(Части[1]);
	//        НоваяСтрока.Тэг      = СокрЛП(Части[2]); // Здесь тэги через запятую
	//        НоваяСтрока.Описание = СокрЛП(Части[3]);
	//    КонецЕсли;
	//КонецЦикла;

    // 3. Передаем таблицу в СКД
    ВнешниеНаборыДанных = Новый Структура;
    ВнешниеНаборыДанных.Вставить("ТаблицаДанных", ТаблицаДанных);
    
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
    
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
    
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
    ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
КонецПроцедуры

Функция ТипСсылка()
	
	// 1. Создаем пустой массив для хранения разрешенных типов
	МассивТипов = Новый Массив;
	
	// 2. Добавляем в массив нужные типы
	// Обязательно указываем конкретные виды документов и справочников
	МассивТипов.Добавить(Тип("ДокументСсылка.ПриходнаяНакладная"));
	МассивТипов.Добавить(Тип("ДокументСсылка.РасходнаяНакладная"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ДвижениеДенег"));
	МассивТипов.Добавить(Тип("ДокументСсылка.Перемещение"));
	МассивТипов.Добавить(Тип("ДокументСсылка._Инвойс"));
	МассивТипов.Добавить(Тип("СправочникСсылка.Контрагенты"));
	МассивТипов.Добавить(Тип("СправочникСсылка.Номенклатура"));
	
	// 3. Создаем объект "ОписаниеТипов" на основе собранного массива
	Возврат Новый ОписаниеТипов(МассивТипов);	
	
КонецФункции // ()

Процедура ЗаполнитьТаблицуДанных(тз)

	Запр = Новый Запрос; 
	Запр.УстановитьПараметр("ДатаНачала", НачалоМесяца(ДобавитьМесяц(ТекущаяДатаСеанса(), -1)));
	Запр.УстановитьПараметр("ДатаОкончания", КонецМесяца(ДобавитьМесяц(ТекущаяДатаСеанса(), -1)));
	
	// 1.
	
	Запр.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             |	ТЧТовары.Ссылка КАК Инвойс,
	             |	ТЧТовары.Номенклатура КАК Номенклатура,
	             |	ТЧТовары.Номенклатура.Вес КАК Вес
	             |ИЗ
	             |	Документ._Инвойс.ВКД_Товары КАК ТЧТовары
	             |ГДЕ
	             |	ТЧТовары.Ссылка В
	             |			(ВЫБРАТЬ
	             |				ПривязкиИнвойсов.Инвойс
	             |			ИЗ
	             |				Документ.ДвижениеДенег.Инвойсы КАК ПривязкиИнвойсов
	             |			ГДЕ
	             |				ПривязкиИнвойсов.Ссылка.Проведен
	             |				И ПривязкиИнвойсов.Ссылка.Дата > ДОБАВИТЬКДАТЕ(&ДатаНачала, МЕСЯЦ, -3))
	             |	И НЕ ТЧТовары.Ссылка.ПометкаУдаления
	             |	И ТЧТовары.Ссылка.Дата >= &ДатаНачала
	             |	И ТЧТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	             |	И ТЧТовары.Номенклатура.Вес < 9";
	Запр.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Выгрузка = Запр.Выполнить().Выгрузить();
	ДобавитьСтрокиТаблицы(тз, Выгрузка.ВыгрузитьКолонку("Номенклатура"), "Заполнить вес номенклатуры", 1);
	ДобавитьСтрокиТаблицы(тз,  Выгрузка.ВыгрузитьКолонку("Инвойс"), "Перепровести инвойсы с товарами без веса", 2);

	// 2.  
	
	Запр.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             |	ПриходнаяНакладная.Ссылка КАК Ссылка
	             |ИЗ
	             |	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
	             |ГДЕ
	             |	ПриходнаяНакладная.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	             |	И НЕ ПриходнаяНакладная.Окончательно
	             |	И ПриходнаяНакладная.Проведен
	             |	И ПриходнаяНакладная.Ссылка В
	             |			(ВЫБРАТЬ
	             |				ТЧТовары.Ссылка
	             |			ИЗ
	             |				Документ.ПриходнаяНакладная.Товары КАК ТЧТовары)";
	Выгрузка = Запр.Выполнить().Выгрузить();
	ДобавитьСтрокиТаблицы(тз, Выгрузка.ВыгрузитьКолонку("Ссылка"), "Установить 'Окончательно'", 2);
	
	Запр.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             |	РасходнаяНакладная.Ссылка КАК Ссылка
	             |ИЗ
	             |	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	             |ГДЕ
	             |	РасходнаяНакладная.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	             |	И НЕ РасходнаяНакладная.Окончательно
	             |	И РасходнаяНакладная.Проведен
	             |	И РасходнаяНакладная.Ссылка В
	             |			(ВЫБРАТЬ
	             |				ТЧТовары.Ссылка
	             |			ИЗ
	             |				Документ.РасходнаяНакладная.Товары КАК ТЧТовары)";
	Запр.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Выгрузка = Запр.Выполнить().Выгрузить();
	ДобавитьСтрокиТаблицы(тз, Выгрузка.ВыгрузитьКолонку("Ссылка"), "Установить <Окончательно>", 3);
	
	// 3.
	
	Запр.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             |	ПриходнаяНакладная.Ссылка КАК Ссылка
	             |ИЗ
	             |	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
	             |ГДЕ
	             |	ПриходнаяНакладная.ВКД_Инвойс <> ЗНАЧЕНИЕ(Документ._Инвойс.ПустаяСсылка)
	             |	И ПриходнаяНакладная.Дата < ПриходнаяНакладная.ВКД_Инвойс.Дата
	             |	И ПриходнаяНакладная.Проведен
	             |	И ПриходнаяНакладная.Дата >= &ДатаНачала
	             |	И ПриходнаяНакладная.ВКД_Инвойс.Проведен";
	Выгрузка = Запр.Выполнить().Выгрузить();
	ДобавитьСтрокиТаблицы(тз, Выгрузка.ВыгрузитьКолонку("Ссылка"), "Изменить дату накладной (дата раньше даты инвойса)", 5);
	
	//4.
	
	Запр.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             |	ОприходНоменклатуры.Документ КАК Документ,
	             |	ОприходНоменклатуры.Номенклатура КАК Номенклатура,
	             |	ОприходНоменклатуры.КоличествоОстаток КАК Количество,
	             |	ОприходНоменклатуры.СуммаЗакупкиОстаток КАК Сумма
	             |ИЗ
	             |	РегистрНакопления.ВКД_ОприходованиеНоменклатуры.Остатки КАК ОприходНоменклатуры
	             |ГДЕ
	             |	ОприходНоменклатуры.Документ.Дата >= &ДатаНачала
	             |	И ОприходНоменклатуры.Документ В
	             |			(ВЫБРАТЬ
	             |				СостоянияИнвойсов.Инвойс
	             |			ИЗ
	             |				РегистрСведений.СостоянияИнвойсов КАК СостоянияИнвойсов
	             |			ГДЕ
	             |				СостоянияИнвойсов.Инвойс.Дата >= &ДатаНачала
	             |				И СостоянияИнвойсов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыИнвойса.Прибыл))"; 
	 Выборка = Запр.Выполнить().Выбрать();
	 Пока Выборка.Следующий() Цикл
	 	ДобавитьСтрокуТаблицы(тз, Выборка.Документ, СтрШаблон("Разница инвойс-накладные '%1': кол-во %2, сумма %3", 
																Выборка.Номенклатура, 
																Выборка.Количество, 
																Формат(Выборка.Сумма,"ЧДЦ=2")), 
																7);
	 КонецЦикла;
	 
	 // 5.  
	 
	 Запр.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	              |	ДвижениеДенегИнвойсы.Ссылка КАК Ссылка
	              |ИЗ
	              |	Документ.ДвижениеДенег.Инвойсы КАК ДвижениеДенегИнвойсы
	              |ГДЕ
	              |	ДвижениеДенегИнвойсы.Инвойс = ЗНАЧЕНИЕ(Документ._Инвойс.ПустаяСсылка)
	              |	И ДвижениеДенегИнвойсы.Ссылка.Проведен
	              |	И ДвижениеДенегИнвойсы.Ссылка.Дата >= &ДатаНачала";
	 Выгрузка = Запр.Выполнить().Выгрузить();
	 ДобавитьСтрокиТаблицы(тз, Выгрузка.ВыгрузитьКолонку("Ссылка"), "В привязках не указан ивойс", 5);

	 // 6.
	 
	  Запр.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ДопЗатратыТЧДокументы.Ссылка КАК ДокДопЗатраты,
	               |	ДопЗатратыТЧДокументы.Документ КАК ПрихНакладнаяИзТЧ,
	               |	ПрихНаклТЧЗатраты.ДокументЗатрат КАК ДокументЗатратВПрихНакладной,
	               |	ДопЗатратыТЧДокументы.Ссылка.Проведен КАК ДокДопЗатратПроведен,
	               |	ПрихНаклТЧЗатраты.Ссылка.Проведен КАК ПрихНакладнаяПроведена
	               |ИЗ
	               |	Документ.ВКД_ДополнительныеЗатраты.Документы КАК ДопЗатратыТЧДокументы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриходнаяНакладная.Затраты КАК ПрихНаклТЧЗатраты
	               |		ПО ДопЗатратыТЧДокументы.Документ = ПрихНаклТЧЗатраты.Ссылка
	               |ГДЕ
	               |	ДопЗатратыТЧДокументы.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
	   Выборка = Запр.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
	        Если НЕ Выборка.ДокДопЗатратПроведен И Выборка.ПрихНакладнаяПроведена Тогда
	 			ДобавитьСтрокуТаблицы(тз, Выборка.ДокДопЗатраты, СтрШаблон("Доп.затраты НЕ зарегистрированы, но прих.накладная с ними проведена: %1, %2", 
																	Выборка.ДокДопЗатраты, 
																	Выборка.ПрихНакладнаяИзТЧ), 
															9);
			КонецЕсли;
	        Если Выборка.ДокДопЗатратПроведен И НЕ Выборка.ПрихНакладнаяПроведена Тогда
	 			ДобавитьСтрокуТаблицы(тз, Выборка.ПрихНакладнаяИзТЧ, СтрШаблон("Доп.затраты зарегистрированы, но прих.накладная с ними не проведена: %1, %2", 
																	Выборка.ДокДопЗатраты, 
																	Выборка.ПрихНакладнаяИзТЧ), 
															9);
			КонецЕсли;
			Если Выборка.ДокДопЗатраты <> Выборка.ДокументЗатратВПрихНакладной Тогда
	 			ДобавитьСтрокуТаблицы(тз, Выборка.ДокДопЗатраты, СтрШаблон("Не совпадают док-т доп.затрат, и прих.накладная: %1, %2", 
																	Выборка.ДокДопЗатраты, 
																	Выборка.ПрихНакладнаяИзТЧ), 
															9);
			КонецЕсли; 
	   КонецЦикла;

	   // 7.
	   
		Запр.Текст = "ВЫБРАТЬ
		             |	ТоварныеДокументыОтправокПеремещений.Количество КАК Количество,
		             |	ТоварныеДокументыОтправокПеремещений.Сумма КАК Сумма,
		             |	ТоварныеДокументыОтправокПеремещений.ТоварныйДокумент КАК ТоварныйДокумент
		             |ИЗ
		             |	Документ.ОтправкаПеремещений.ТоварныеДокументы КАК ОтправкаПеремещенийТЧ
		             |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		             |			СУММА(ПеремещениеТовары.Количество) КАК Количество,
		             |			СУММА(ПеремещениеТовары.СуммаЗакупки) КАК Сумма,
		             |			ПеремещениеТовары.Ссылка КАК ТоварныйДокумент
		             |		ИЗ
		             |			Документ.Перемещение.Товары КАК ПеремещениеТовары
		             |		ГДЕ
		             |			ПеремещениеТовары.Ссылка В
		             |					(ВЫБРАТЬ
		             |						ТЧ.ТоварныйДокумент
		             |					ИЗ
		             |						Документ.ОтправкаПеремещений.ТоварныеДокументы КАК ТЧ
		             |					ГДЕ
		             |						ТЧ.Ссылка.Проведен
		             |						И ТЧ.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
		             |		
		             |		СГРУППИРОВАТЬ ПО
		             |			ПеремещениеТовары.Ссылка
		             |		
		             |		ОБЪЕДИНИТЬ
		             |		
		             |		ВЫБРАТЬ
		             |			СУММА(РасходнаяТовары.Количество),
		             |			СУММА(РасходнаяТовары.СуммаЗакупки),
		             |			РасходнаяТовары.Ссылка
		             |		ИЗ
		             |			Документ.РасходнаяНакладная.Товары КАК РасходнаяТовары
		             |		ГДЕ
		             |			РасходнаяТовары.Ссылка В
		             |					(ВЫБРАТЬ
		             |						ТЧ.ТоварныйДокумент
		             |					ИЗ
		             |						Документ.ОтправкаПеремещений.ТоварныеДокументы КАК ТЧ
		             |					ГДЕ
		             |						ТЧ.Ссылка.Проведен
		             |						И ТЧ.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
		             |		
		             |		СГРУППИРОВАТЬ ПО
		             |			РасходнаяТовары.Ссылка) КАК ТоварныеДокументыОтправокПеремещений
		             |		ПО ОтправкаПеремещенийТЧ.ТоварныйДокумент = ТоварныеДокументыОтправокПеремещений.ТоварныйДокумент";
	
		// 100. 
		
		Запр.УстановитьПараметр("ДатаТекущая", ТекущаяДатаСеанса());
		Запр.Текст = "ВЫБРАТЬ
		             |	ДокументыКПроведению.Документ КАК Документ,
		             |	ДокументыКПроведению.Инициатор КАК Инициатор
		             |ИЗ
		             |	РегистрСведений.ДокументыКПроведению КАК ДокументыКПроведению
		             |ГДЕ
		             |	ДокументыКПроведению.Зарегистрировано < ДОБАВИТЬКДАТЕ(&ДатаТекущая, ДЕНЬ, -1)";	
		Выгрузка = Запр.Выполнить().Выгрузить();
		ДобавитьСтрокиТаблицы(тз, Выгрузка.ВыгрузитьКолонку("Документ"), "Не удается автоматически перепровести", 100);

		
КонецПроцедуры

Процедура ДобавитьСтрокиТаблицы(тз, МассивОбъектов, Задача, Приоритет)
	
	Для каждого Эл Из МассивОбъектов Цикл  
		ДобавитьСтрокуТаблицы(тз, Эл, Задача, Приоритет)
	КонецЦикла;

КонецПроцедуры 

Процедура ДобавитьСтрокуТаблицы(тз, Объект, Задача, Приоритет)
	
	НайдСтроки = тз.НайтиСтроки(Новый Структура("Объект", Объект));
	Если НайдСтроки.Количество() = 0 Тогда
		СтрокаТЗ = тз.Добавить();
	Иначе	
		СтрокаТЗ = НайдСтроки[0];
		Если Найти(СтрокаТЗ.Задача, Задача) > 0 Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	СтрокаТЗ.Объект	= Объект;  
	Если ЗначениеЗаполнено(СтрокаТЗ.Задача) Тогда
		СтрокаТЗ.Задача = СтрокаТЗ.Задача + ";" + Символы.ПС;
	КонецЕсли;
	СтрокаТЗ.Задача	= "" + СтрокаТЗ.Задача + Задача;
	СтрокаТЗ.Приоритет	= Приоритет;
	
КонецПроцедуры

