
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	// 1. Получаем текст макета
	ИмяМакета = "ОсновнаяСхемаКомпоновкиДанных";
	СхемаКомпоновкиДанных = ПолучитьМакет(ИмяМакета);
	Настройки = КомпоновщикНастроек.Настройки;
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	// 2. Создаем таблицу для СКД
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("Объект", 	ТипСсылка());
	ТаблицаДанных.Колонки.Добавить("Задача", 	Новый ОписаниеТипов("Строка"));
	ТаблицаДанных.Колонки.Добавить("Приоритет", Новый ОписаниеТипов("Число"));
	//ТаблицаДанных.Колонки.Добавить("Описание");
	
	ЗаполнитьТаблицуДанных(ТаблицаДанных);
	
	//// Алгоритм разбора строк (условно, если в макете разделитель "|")
	//Для НомерСтроки = 1 По СтрЧислоСтрок(МакетТекст) Цикл
	//    ТекСтрока = СтрПолучитьСтроку(МакетТекст, НомерСтроки);
	//    // Пример парсинга: Дата | Заказчик | Тэги | Описание
	//    Части = СтрРазделить(ТекСтрока, "|");
	//    Если Части.Количество() >= 4 Тогда
	//        НоваяСтрока = ТаблицаДанных.Добавить();
	//        НоваяСтрока.Дата     = Дата(СокрЛП(Части[0]));
	//        НоваяСтрока.Заказчик = СокрЛП(Части[1]);
	//        НоваяСтрока.Тэг      = СокрЛП(Части[2]); // Здесь тэги через запятую
	//        НоваяСтрока.Описание = СокрЛП(Части[3]);
	//    КонецЕсли;
	//КонецЦикла;

    // 3. Передаем таблицу в СКД
    ВнешниеНаборыДанных = Новый Структура;
    ВнешниеНаборыДанных.Вставить("ТаблицаДанных", ТаблицаДанных);
    
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
    
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
    
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
    ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
КонецПроцедуры

Функция ТипСсылка()
	
	// 1. Создаем пустой массив для хранения разрешенных типов
	МассивТипов = Новый Массив;
	
	// 2. Добавляем в массив нужные типы
	// Обязательно указываем конкретные виды документов и справочников
	МассивТипов.Добавить(Тип("ДокументСсылка.ПриходнаяНакладная"));
	МассивТипов.Добавить(Тип("ДокументСсылка.РасходнаяНакладная"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ДвижениеДенег"));
	МассивТипов.Добавить(Тип("ДокументСсылка.Перемещение"));
	МассивТипов.Добавить(Тип("ДокументСсылка._Инвойс"));
	МассивТипов.Добавить(Тип("СправочникСсылка.Контрагенты"));
	МассивТипов.Добавить(Тип("СправочникСсылка.Номенклатура"));
	
	// 3. Создаем объект "ОписаниеТипов" на основе собранного массива
	Возврат Новый ОписаниеТипов(МассивТипов);	
	
КонецФункции // ()

Процедура ЗаполнитьТаблицуДанных(тз)

	Запр = Новый Запрос;
	
	// 1.
	
	Запр.Текст = "ВЫБРАТЬ
	             |	ТЧТовары.Ссылка КАК Инвойс,
	             |	ТЧТовары.Номенклатура КАК Номенклатура,
	             |	ТЧТовары.Номенклатура.Вес КАК Вес
	             |ИЗ
	             |	Документ._Инвойс.ВКД_Товары КАК ТЧТовары
	             |ГДЕ
	             |	ТЧТовары.Ссылка В
	             |			(ВЫБРАТЬ
	             |				ПривязкиИнвойсов.Инвойс
	             |			ИЗ
	             |				Документ.ДвижениеДенег.Инвойсы КАК ПривязкиИнвойсов
	             |			ГДЕ
	             |				ПривязкиИнвойсов.Ссылка.Проведен
	             |				И ПривязкиИнвойсов.Ссылка.Дата > ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -3))
	             |	И НЕ ТЧТовары.Ссылка.ПометкаУдаления
	             |	И ТЧТовары.Ссылка.Дата >= НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1), МЕСЯЦ)
	             |	И ТЧТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	             |	И ТЧТовары.Номенклатура.Вес < 9";
	Запр.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Выгрузка = Запр.Выполнить().Выгрузить();
	ДобавитьСтрокиТаблицы(тз, Выгрузка.ВыгрузитьКолонку("Номенклатура"), "Заполнить вес номенклатуры", 1);
	ДобавитьСтрокиТаблицы(тз,  Выгрузка.ВыгрузитьКолонку("Инвойс"), "Перепровести инвойсы с товарами без веса", 2);

	// 2. 
	
КонецПроцедуры

Процедура ДобавитьСтрокиТаблицы(тз, МассивОбъектов, Задача, Приоритет)
	
	Для каждого Эл Из МассивОбъектов Цикл 
		НайдСтроки = тз.НайтиСтроки(Новый Структура("Объект", Эл));
		Если НайдСтроки.Количество() = 0 Тогда
			СтрокаТЗ = тз.Добавить();
		Иначе	
		    СтрокаТЗ = НайдСтроки[0];
			Если Найти(СтрокаТЗ.Задача, Задача) > 0 Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		СтрокаТЗ.Объект	= Эл;  
		Если ЗначениеЗаполнено(СтрокаТЗ.Задача) Тогда
			СтрокаТЗ.Задача = СтрокаТЗ.Задача + "; ";
		КонецЕсли;
		СтрокаТЗ.Задача	= "" + СтрокаТЗ.Задача + Задача;
		СтрокаТЗ.Приоритет	= Приоритет;
	КонецЦикла;

КонецПроцедуры
