
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если ЗначениеЗаполнено(Запись.ИдентификаторЗапроса) Тогда
		
		// РАСПАКОВКА ИЗ ХРАНИЛИЩА ЗНАЧЕНИЯ
		
		// Извлекаем заголовки
		Если ТипЗнч(Запись.ЗаголовкиЗапроса) = Тип("ХранилищеЗначения") Тогда
			ТекстЗаголовки = Запись.ЗаголовкиЗапроса.Получить();
			// Если внутри был Неопределено, заменяем на пустую строку для эстетики
			Если ТекстЗаголовки = Неопределено Тогда ТекстЗаголовки = ""; КонецЕсли;
		КонецЕсли;
		
		// Извлекаем тело запроса (входящий JSON)
		Если ТипЗнч(Запись.ТелоЗапроса) = Тип("ХранилищеЗначения") Тогда
			ТекстТелоЗапроса = Запись.ТелоЗапроса.Получить();
			Если ТекстТелоЗапроса = Неопределено Тогда ТекстТелоЗапроса = ""; КонецЕсли;
		КонецЕсли;
		
		// Извлекаем тело ответа (исходящий JSON)
		Если ТипЗнч(Запись.ТелоОтвета) = Тип("ХранилищеЗначения") Тогда
			ТекстТелоОтвета = Запись.ТелоОтвета.Получить();
			Если ТекстТелоОтвета = Неопределено Тогда ТекстТелоОтвета = ""; КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
