#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Валюта = Параметры.Валюта; 
	Вал = Валюта.Символ;     
	//Элементы.ИнвойсыИнвойсСумма.Заголовок = СтрШаблон("%1 (%2)", НСтр("ru = 'Сумма'; en = 'Сумма'"), Вал); 
	Элементы.ИнвойсыДолг.Заголовок = СтрШаблон("%1 (%2)", НСтр("ru = 'Сумма долга'; en = 'Сумма долга'"), Вал); 
	Элементы.ИнвойсыОстаток.Заголовок = СтрШаблон("%1 (%2)", НСтр("ru = 'Остаток долга'; en = 'Остаток долга'"), Вал); 
	Если Параметры.Дата <> Дата(1,1,1) Тогда
		Дата = Параметры.Дата;  
		лДата = Дата;    
	ИначеЕсли ЗначениеЗаполнено(Параметры.Документ.Ссылка) Тогда
		Дата = Параметры.Документ.Ссылка.МоментВремени();  
		лДата = Параметры.Документ.Ссылка.МоментВремени().Дата;
	Иначе
		Дата = ТекущаяДатаСеанса();
		лДата = Дата;
	КонецЕсли;
	Заголовок = СтрШаблон("%1: %2 %3", Параметры.Контрагент, НСтр("ru = 'оплата (привязка) инвойсов на'; en = 'payment (binding) of invoices at'"), лДата);
	
	//СуммаОбщая = Параметры.Документ.Сумма - Параметры.Документ.СуммаПривязаноИнвойсов;
	СуммаОбщая = Параметры.Документ.Сумма;
	СуммаПривязано = Параметры.Документ.СуммаПривязаноИнвойсов;
	СуммаНеПривязано = Макс(0, СуммаОбщая - СуммаПривязано);
	
	//глПокраситьВалюты(ЭтаФорма, "Валюта", "Инвойсы");  
	
	Запрос = Новый Запрос;     
	// значения формы док-та
	Запрос.УстановитьПараметр("Контрагент", 	Параметры.Контрагент);
	Запрос.УстановитьПараметр("ДвижениеДенег",	Параметры.Документ.Ссылка);
	Запрос.УстановитьПараметр("ТЧ", 			Параметры.ИнвойсыТЧ.Выгрузить());  
	// значения ссылки док-та
	//Запрос.УстановитьПараметр("Дата", Дата);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тч.Инвойс КАК Инвойс,
		|	тч.Сумма КАК Сумма
		|ПОМЕСТИТЬ ТЧ
		|ИЗ
		|	&тч КАК тч
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Взаиморасчеты.Инвойс КАК Инвойс,
		|	Взаиморасчеты.Инвойс.СуммаВВалютеИнвойса КАК Сумма,
		|	Взаиморасчеты.Инвойс.Валюта КАК Валюта,
		|	Взаиморасчеты.Долг КАК Остаток,
		|	СостоянияИнвойсов.СтатусОплатыАвто КАК Состояние
		|ИЗ
		|	(ВЫБРАТЬ
		|		Свод.Инвойс КАК Инвойс,
		|		СУММА(Свод.Сумма) КАК Долг
		|	ИЗ
		|		(ВЫБРАТЬ
		|			""Данные из формы документа"" КАК Источник,
		|			ТЧ.Инвойс КАК Инвойс,
		|			-ТЧ.Сумма КАК Сумма
		|		ИЗ
		|			ТЧ КАК ТЧ
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			""Данные из движений документа"",
		|			ИнвойсыДокумента.Инвойс,
		|			ВЫБОР
		|				КОГДА ИнвойсыДокумента.Ссылка.Проведен
		|					ТОГДА ИнвойсыДокумента.Сумма
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|		ИЗ
		|			Документ.ДвижениеДенег.Инвойсы КАК ИнвойсыДокумента
		|		ГДЕ
		|			ИнвойсыДокумента.Ссылка = &ДвижениеДенег
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			""Данные из РН"",
		|			РасчетыПоИнвойсам.Инвойс,
		|			РасчетыПоИнвойсам.СуммаОстаток
		|		ИЗ
		|			РегистрНакопления.РасчетыПоИнвойсам.Остатки(
		|					,
		|					Контрагент = &Контрагент
		|						И НЕ Инвойс.ТолькоУслуги) КАК РасчетыПоИнвойсам) КАК Свод
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Свод.Инвойс) КАК Взаиморасчеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияИнвойсов КАК СостоянияИнвойсов
		|		ПО Взаиморасчеты.Инвойс = СостоянияИнвойсов.Инвойс";
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Инвойсы.Загрузить(Выгрузка);
	
	Для каждого СтрокаТаблицы Из Инвойсы Цикл
		лКурс = омСервер.КроссКурс(СтрокаТаблицы.Инвойс.Валюта, Валюта, Параметры.Документ.Фирма,, лДата,,);
	    СтрокаТаблицы.Сумма 		= СтрокаТаблицы.Сумма * лКурс;
	    СтрокаТаблицы.Остаток 		= СтрокаТаблицы.Остаток * лКурс;
	КонецЦикла;
	
	ВыбранныеИнвойсы.ЗагрузитьЗначения(Параметры.ИнвойсыТЧ.Выгрузить().ВыгрузитьКолонку("Инвойс"));
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	// ВыбранныеИнвойсы
	
	ЭлементОформления = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Метаданные.ЭлементыСтиля.ЦветФонаСтрокиИсключаемойИзВыбора.Значение);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,, Истина)); 
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Инвойсы.Инвойс"); 
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.ПравоеЗначение = ВыбранныеИнвойсы;
	ЭлементОтбора.Использование  = Истина;
	ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ИнвойсыИнвойс"); 
	ОформляемоеПоле.Использование = Истина;
	
	// Состояние (статусы)

	Запр = Новый Запрос; 
	Запр.Текст = "ВЫБРАТЬ
	             |	ЦветаОформления.Значение КАК Цвет,
	             |	ЦветаОформления.Настройка.ИмяПредопределенныхДанных КАК Статус
	             |ИЗ
	             |	РегистрСведений.ЦветаОформления КАК ЦветаОформления
	             |ГДЕ
	             |	ЦветаОформления.Настройка.Родитель = &ГруппаНастроек
	             |	И ЦветаОформления.Значение <> """"";
	Запр.УстановитьПараметр("ГруппаНастроек", ПланыВидовХарактеристик.ЦветаОформления.СтатусыПривязкиИнвойсов);
	Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	
		ЭлементОформления = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", гоЦветРГБ(Выборка.Цвет));
		//ЭлементОформления.Использование 		= Истина;
		ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Инвойсы.Состояние");
		ЭлементОтбора.ВидСравнения  	= ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение 	= Перечисления.Долги[СтрЗаменить(Выборка.Статус,"Инв_","")];
		ЭлементОтбора.Использование 	= Истина;
		
		ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле 			= Новый ПолеКомпоновкиДанных("Инвойсы.Состояние");
		ОформляемоеПоле.Использование 	= Истина;
	
	КонецЦикла;

	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ОбновитьИтоги();

КонецПроцедуры

#КонецОбласти


#Область СобытияТаблицы

&НаКлиенте
Процедура ИнвойсыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ИнвойсыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ИнвойсыПометкаПриИзменении(Элемент)
	
	ТекДанные = Элементы.Инвойсы.ТекущиеДанные;
	Если ТекДанные.Пометка Тогда
		//Если ТекДанные.Дубль = Ложь или ТекДанные.Остаток > 0 Тогда 
		//	Если СуммаОстаток <= ТекДанные.Остаток И СуммаОстаток > 0 Тогда
		//		ТекДанные.Долг = СуммаОстаток;
		//		ТекДанные.Остаток = ТекДанные.Остаток - ТекДанные.Долг;
		//		СуммаПривязано = СуммаПривязано + ТекДанные.Долг; 
		//		СуммаОстаток = СуммаДокумента - СуммаПривязано;
		//		Остаток = ТекДанные.Остаток;
		//		Сумма = ТекДанные.Сумма;
		//		ТекДанные.Состояние = ПолучитьСостояние(Остаток,Сумма);
		//	ИначеЕсли СуммаОстаток > ТекДанные.Остаток Тогда
		//		ТекДанные.Долг = ТекДанные.Остаток;
		//		ТекДанные.Остаток = ТекДанные.Остаток - ТекДанные.Долг;
		//		СуммаПривязано = СуммаПривязано + ТекДанные.Долг;
		//		СуммаОстаток = СуммаДокумента - СуммаПривязано;
		//		Остаток = ТекДанные.Остаток;
		//		Сумма = ТекДанные.Сумма;
		//		ТекДанные.Состояние = ПолучитьСостояние(Остаток,Сумма);
		//	ИначеЕсли СуммаОстаток = 0 Тогда
		//		ТекДанные.ВыборП = Ложь;
		//	КонецЕсли; 
		//ИначеЕсли ТекДанные.Дубль = Истина или ТекДанные.Остаток = 0 Тогда 
		//	ТекДанные.ВыборП = Ложь;
		//КонецЕсли;
	Иначе 
		//ТекДанные.Остаток = ТекДанные.Остаток + ТекДанные.Долг;
		//СуммаПривязано = СуммаПривязано - ТекДанные.Долг;
		//СуммаОстаток = СуммаДокумента - СуммаПривязано;
		//ТекДанные.Долг = "";
		//Остаток = ТекДанные.Остаток;
		//Сумма = ТекДанные.Сумма;
		//ТекДанные.Состояние = ПолучитьСостояние(Остаток,Сумма);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИнвойсыПередНачаломИзменения(Элемент, Отказ)
	
	ТекДанные = Элемент.ТекущиеДанные;
	СуммаДоРедактирования = ТекДанные.Долг;
	
	Если ТекДанные.Состояние = ПредопределенноеЗначение("Перечисление.Долги.Полностью") Тогда 
		Сообщить("" + текДанные.Инвойс + " оплачен полностью!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Элемент.ТекущийЭлемент.Имя = "ИнвойсыДолг" Тогда  
		//МожноПривязать = СуммаОбщая - СуммаПривязано
		Если СуммаНеПривязано > 0 Тогда
			лПривяз = Мин(ТекДанные.Остаток, СуммаНеПривязано);  
			ТекДанные.Долг		= лПривяз;
			ТекДанные.Остаток	= ТекДанные.Остаток - ТекДанные.Долг;
			СуммаПривязано 		= СуммаПривязано + лПривяз;
			СуммаНеПривязано 	= СуммаНеПривязано - лПривяз;
			ОбновитьИтоги();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
 
&НаКлиенте
Процедура ИнвойсыПриИзменении(Элемент)
	
	// для редактирования доступно только поле "Долг"
	
	ТекДанные = Элемент.ТекущиеДанные; 
	Если ТекДанные.Долг > СуммаДоРедактирования Тогда
		лМожноПривязать = Мин(ТекДанные.Долг - СуммаДоРедактирования, СуммаНеПривязано); 
		ТекДанные.Долг 	= ТекДанные.Долг + лМожноПривязать;
	КонецЕсли;
	
	ТекДанные.Остаток 	= ТекДанные.Сумма - ТекДанные.Долг;
	
	//Если ТекДанные.Долг > ТекДанные.ДолгДоПривязки - ТекДанные.Остаток И СуммаНеПривязано = 0 Тогда
	//	// распределять больше нечего	
	//	ТекДанные.Долг = ТекДанные.ДолгДоПривязки - ТекДанные.Остаток;
	//Иначе
	//	ТекДанные.Остаток = ТекДанные.ДолгДоПривязки - ТекДанные.Долг;
	//КонецЕсли;
	
	СуммаПривязано = Инвойсы.Итог("Долг");
	СуммаНеПривязано = СуммаОбщая - СуммаПривязано;
		
	ОбновитьИтоги();  
	
КонецПроцедуры

&НаКлиенте
Процедура ИнвойсыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле.Имя = "ИнвойсыИнвойс" Тогда                                        
		СтандартнаяОбработка = Ложь;
		ОткрытьЗначение(Элемент.ТекущиеДанные.Инвойс); 
	КонецЕсли;  

КонецПроцедуры

#КонецОбласти 


&НаКлиенте
Процедура ОбновитьИтоги()
	
	ЦвОстатка = ?(СуммаНеПривязано = 0, "ЧИСЛО_ЦВКРАСНЫЙ_ТЕКСТ", "ЧИСЛО_ЦВ2");

	СтруктураИтогов = Новый Структура;
	Стр = СтрШаблон("<p>%1: %2 %3 %4 %5 %3</p>", 
						омСервер.Фрмт(НСтр("ru = 'Еще можно привязать'; en = 'You can also bind'"), "НАДПИСЬ_Ж"), 
					    омСервер.Фрмт(СуммаНеПривязано, ЦвОстатка),
					    омСервер.Фрмт(Валюта, "НАДПИСЬ_ЦВ2"),
	                    омСервер.Фрмт(НСтр("ru = 'из'; en = 'of'"), "НАДПИСЬ_Ж"),
					    омСервер.Фрмт(СуммаОбщая, "ЧИСЛО_ЦВ2")
						);
	СтруктураИтогов.Вставить("Итоги", Стр); 

	Элементы.ДекорацияИтого.Заголовок = Новый ФорматированнаяСтрока(ОбщегоНазначения.ТекстHTMLВФорматированнуюСтроку(СтруктураИтогов.Итоги));
	
	Элементы.СохранитьВыбор.КнопкаПоУмолчанию = СуммаНеПривязано = 0;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВыбор(Команда)
	
	МассивИ = Новый Массив;
	Для Каждого строкаВ из Инвойсы Цикл
		//Если НЕ строкаВ.Долг = 0 Тогда 
		Если строкаВ.Долг > 0 Тогда 
			МассивИ.Добавить(строкаВ);
		КонецЕсли;
	КонецЦикла;
	ЭтаФорма.Закрыть(МассивИ);

КонецПроцедуры


&НаКлиенте
Процедура СвязанныеДокументы(Команда)

	ОткрытьФорму("ОбщаяФорма.ФормаСтруктурыПодчиненности", Новый Структура("ДокументСсылка", Элементы.Инвойсы.ТекущиеДанные.Инвойс), , Истина, );

КонецПроцедуры

