#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Валюта = Параметры.Валюта; 
	Вал = Валюта.Символ;     
	//Элементы.ИнвойсыИнвойсСумма.Заголовок = СтрШаблон("%1 (%2)", НСтр("ru = 'Сумма'; en = 'Сумма'"), Вал); 
	Элементы.ИнвойсыДолг.Заголовок = СтрШаблон("%1 (%2)", НСтр("ru = 'Сумма долга'; en = 'Сумма долга'"), Вал); 
	Элементы.ИнвойсыОстаток.Заголовок = СтрШаблон("%1 (%2)", НСтр("ru = 'Остаток долга'; en = 'Остаток долга'"), Вал); 
	Если Параметры.Дата <> Дата(1,1,1) Тогда
		Дата = Параметры.Дата;  
		лДата = Дата;    
	ИначеЕсли ЗначениеЗаполнено(Параметры.Документ.Ссылка) Тогда
		Дата = Параметры.Документ.Ссылка.МоментВремени();  
		лДата = Параметры.Документ.Ссылка.МоментВремени().Дата;
	Иначе
		Дата = ТекущаяДатаСеанса();
		лДата = Дата;
	КонецЕсли;
	Заголовок = СтрШаблон("%1: %2 %3", Параметры.Контрагент, НСтр("ru = 'оплата (привязка) инвойсов на'; en = 'payment (binding) of invoices at'"), лДата);
	
	СуммаОбщая = Параметры.Документ.Сумма - Параметры.Документ.СуммаПривязаноИнвойсов; 
	СуммаПривязано = Параметры.Документ.СуммаПривязаноИнвойсов;
	СуммаНеПривязано = СуммаОбщая - СуммаПривязано;
		
	Запрос = Новый Запрос;     
	// значения формы док-та
	Запрос.УстановитьПараметр("Контрагент", 	Параметры.Контрагент);
	Запрос.УстановитьПараметр("ДвижениеДенег",	Параметры.Документ.Ссылка);
	Запрос.УстановитьПараметр("ТЧ", 			Параметры.ИнвойсыТЧ.Выгрузить());  
	// значения ссылки док-та
	//Запрос.УстановитьПараметр("Дата", Дата);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тч.Инвойс КАК Инвойс,
		|	тч.Сумма КАК Сумма
		|ПОМЕСТИТЬ ТЧ
		|ИЗ
		|	&тч КАК тч
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Взаиморасчеты.Инвойс КАК Инвойс,
		|	Взаиморасчеты.Инвойс.Сумма КАК Сумма,
		|	Взаиморасчеты.Инвойс.Валюта КАК Валюта,
		|	Взаиморасчеты.Долг КАК Долг,
		|	СостоянияИнвойсов.СтатусОплатыАвто КАК Состояние
		|ИЗ
		|	(ВЫБРАТЬ
		|		Свод.Инвойс КАК Инвойс,
		|		СУММА(Свод.Сумма) КАК Долг
		|	ИЗ
		|		(ВЫБРАТЬ
		|			""Данные из формы документа"" КАК Источник,
		|			ТЧ.Инвойс КАК Инвойс,
		|			-ТЧ.Сумма КАК Сумма
		|		ИЗ
		|			ТЧ КАК ТЧ
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			""Данные из движений документа"",
		|			ИнвойсыДокумента.Инвойс,
		|			ВЫБОР
		|				КОГДА ИнвойсыДокумента.Ссылка.Проведен
		|					ТОГДА ИнвойсыДокумента.Сумма
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|		ИЗ
		|			Документ.ДвижениеДенег.Инвойсы КАК ИнвойсыДокумента
		|		ГДЕ
		|			ИнвойсыДокумента.Ссылка = &ДвижениеДенег
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			""Данные из РН"",
		|			РасчетыПоИнвойсам.Инвойс,
		|			РасчетыПоИнвойсам.СуммаОстаток
		|		ИЗ
		|			РегистрНакопления.РасчетыПоИнвойсам.Остатки(, Контрагент = &Контрагент) КАК РасчетыПоИнвойсам) КАК Свод
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Свод.Инвойс) КАК Взаиморасчеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияИнвойсов КАК СостоянияИнвойсов
		|		ПО Взаиморасчеты.Инвойс = СостоянияИнвойсов.Инвойс";
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Инвойсы.Загрузить(Выгрузка);
	
	Для каждого СтрокаТаблицы Из Инвойсы Цикл
		лКурс = омСервер.КроссКурс(СтрокаТаблицы.Инвойс.Валюта, Валюта, Параметры.Документ.Фирма,, лДата,,);
	    СтрокаТаблицы.Сумма 		= СтрокаТаблицы.Сумма * лКурс;
	    СтрокаТаблицы.Долг 			= СтрокаТаблицы.Долг * лКурс;
		СтрокаТаблицы.ДолгДоПривязки= СтрокаТаблицы.Долг;
	КонецЦикла;
	
		////РезультатЗапроса = Запрос.Выполнить();
		////Выборка = РезультатЗапроса.Выбрать();
		////
		////ИнвоХ = ЭтаФорма.Параметры.Инвойсы;
		////
		////Пока Выборка.Следующий() Цикл
		////	НовыйИнвойс = Инвойсы.Добавить();
		////	НовыйИнвойс.Инвойс = Выборка.Ссылка;
		////	НовыйИнвойс.Сумма = Выборка.Сумма;
		////	НовыйИнвойс.Остаток = Выборка.Сумма;
		////	НовыйИнвойс.Примечание = Выборка.Примечание; 
		////	НовыйИнвойс.Состояние = Выборка.СтатусОплатыАвто;
		////КонецЦикла;
		////
		////Для Каждого СтрокаИнвойс Из Инвойсы Цикл 
		////	Для Каждого СтрокаВыбора Из ИнвоХ Цикл
		////		Если СтрокаВыбора.Инвойс = СтрокаИнвойс.Инвойс Тогда
		////			СтрокаИнвойс.Остаток = СтрокаВыбора.Остаток;
		////			СтрокаИнвойс.Дубль = Истина;
		////		КонецЕсли;
		////	КонецЦикла;
		////	////РегистрНакоплений
		////	//Запрос = Новый Запрос;
		////	//Запрос.Текст = 
		////	//"ВЫБРАТЬ
		////	//|	ОплатыИнвойсовДвижениеДенегОстатки.СуммаОплатыОстаток КАК СуммаОплатыОстаток
		////	//|ИЗ
		////	//|	РегистрНакопления.ОплатыИнвойсовДвижениеДенег.Остатки КАК ОплатыИнвойсовДвижениеДенегОстатки
		////	//|ГДЕ
		////	//|	ОплатыИнвойсовДвижениеДенегОстатки.ИнвойсСсылка = &ИнвойсСсылка";
		////	//Запрос.УстановитьПараметр("ИнвойсСсылка", СтрокаИнвойс.Инвойс);
		////	//РезультатЗапроса = Запрос.Выполнить();
		////	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		////	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		////	//	Оплачено = ВыборкаДетальныеЗаписи.СуммаОплатыОстаток;
		////	//	СтрокаИнвойс.Остаток = СтрокаИнвойс.Сумма - Оплачено;
		////	//КонецЦикла;
		////	//Если СтрокаИнвойс.Остаток = 0 Тогда 
		////	//	СтрокаИнвойс.Состояние = Перечисления.Долги.Полностью;
		////	//ИначеЕсли СтрокаИнвойс.Остаток = СтрокаИнвойс.Сумма Тогда 
		////	//	СтрокаИнвойс.Состояние = Перечисления.Долги.Неоплачено;
		////	//ИначеЕсли СтрокаИнвойс.Остаток < СтрокаИнвойс.Сумма и СтрокаИнвойс.Остаток > 0 Тогда 
		////	//	СтрокаИнвойс.Состояние = Перечисления.Долги.Частично;
		////	//КонецЕсли;
		////	Запр = Новый Запрос;
		////	Запр.Текст = "ВЫБРАТЬ
		////	             |	Взаиморасчеты.Инвойс КАК Инвойс,
		////	             |	Взаиморасчеты.Валюта КАК Валюта,
		////	             |	Взаиморасчеты.СуммаОплатыОстаток КАК СуммаОплатыОстаток
		////	             |ИЗ
		////	             |	РегистрНакопления._ВзаиморасчетыСПоставщиками.Остатки(&Дата, Контрагент = &Контрагент) КАК Взаиморасчеты";
		////	Запр.УстановитьПараметр("Дата", );
		////	Запр.УстановитьПараметр("Контрагент", Параметры.Контрагент);
		////КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ОбновитьИтоги();

КонецПроцедуры

#КонецОбласти


#Область СобытияТаблицы

&НаКлиенте
Процедура ИнвойсыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ИнвойсыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ИнвойсыПометкаПриИзменении(Элемент)
	
	ТекДанные = Элементы.Инвойсы.ТекущиеДанные;
	Если ТекДанные.Пометка Тогда
		//Если ТекДанные.Дубль = Ложь или ТекДанные.Остаток > 0 Тогда 
		//	Если СуммаОстаток <= ТекДанные.Остаток И СуммаОстаток > 0 Тогда
		//		ТекДанные.Долг = СуммаОстаток;
		//		ТекДанные.Остаток = ТекДанные.Остаток - ТекДанные.Долг;
		//		СуммаПривязано = СуммаПривязано + ТекДанные.Долг; 
		//		СуммаОстаток = СуммаДокумента - СуммаПривязано;
		//		Остаток = ТекДанные.Остаток;
		//		Сумма = ТекДанные.Сумма;
		//		ТекДанные.Состояние = ПолучитьСостояние(Остаток,Сумма);
		//	ИначеЕсли СуммаОстаток > ТекДанные.Остаток Тогда
		//		ТекДанные.Долг = ТекДанные.Остаток;
		//		ТекДанные.Остаток = ТекДанные.Остаток - ТекДанные.Долг;
		//		СуммаПривязано = СуммаПривязано + ТекДанные.Долг;
		//		СуммаОстаток = СуммаДокумента - СуммаПривязано;
		//		Остаток = ТекДанные.Остаток;
		//		Сумма = ТекДанные.Сумма;
		//		ТекДанные.Состояние = ПолучитьСостояние(Остаток,Сумма);
		//	ИначеЕсли СуммаОстаток = 0 Тогда
		//		ТекДанные.ВыборП = Ложь;
		//	КонецЕсли; 
		//ИначеЕсли ТекДанные.Дубль = Истина или ТекДанные.Остаток = 0 Тогда 
		//	ТекДанные.ВыборП = Ложь;
		//КонецЕсли;
	Иначе 
		//ТекДанные.Остаток = ТекДанные.Остаток + ТекДанные.Долг;
		//СуммаПривязано = СуммаПривязано - ТекДанные.Долг;
		//СуммаОстаток = СуммаДокумента - СуммаПривязано;
		//ТекДанные.Долг = "";
		//Остаток = ТекДанные.Остаток;
		//Сумма = ТекДанные.Сумма;
		//ТекДанные.Состояние = ПолучитьСостояние(Остаток,Сумма);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИнвойсыПередНачаломИзменения(Элемент, Отказ)
	
	ТекДанные = Элемент.ТекущиеДанные;
	
	Если ТекДанные.Состояние = ПредопределенноеЗначение("Перечисление.Долги.Полностью") Тогда 
		Сообщить("" + текДанные.Инвойс + " оплачен полностью!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Элемент.ТекущийЭлемент.Имя = "ИнвойсыДолг" Тогда 
		Если СуммаНеПривязано > 0 Тогда
			лПривяз = Мин(ТекДанные.Долг, СуммаНеПривязано);
			ТекДанные.Долг 		= лПривяз;                     
			ТекДанные.Остаток 	= ТекДанные.ДолгДоПривязки - ТекДанные.Долг;
			СуммаПривязано 		= СуммаПривязано + лПривяз;
			СуммаНеПривязано 	= СуммаНеПривязано - лПривяз;
			ОбновитьИтоги();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
 
&НаКлиенте
Процедура ИнвойсыПриИзменении(Элемент)
	
	// для редактирования доступно только поле "Долг"
	
	ТекДанные = Элемент.ТекущиеДанные; 
	//лПривяз = Мин(ТекДанные.Долг, СуммаНеПривязано);
		
	Если СуммаНеПривязано < ТекДанные.Остаток Тогда   
		
		
	Иначе
		
		ТекДанные.Остаток = ТекДанные.ДолгДоПривязки - ТекДанные.Долг;
		
	КонецЕсли;
		
	ОбновитьИтоги();  
	
КонецПроцедуры


&НаКлиенте
Процедура ИнвойсыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле.Имя = "ИнвойсыИнвойс" Тогда                                        
		СтандартнаяОбработка = Ложь;
		ОткрытьЗначение(Элемент.ТекущиеДанные.Инвойс); 
	КонецЕсли;  

КонецПроцедуры

#КонецОбласти 

&НаКлиенте
Процедура ОбновитьИтоги()
	
	ЦвОстатка = ?(СуммаНеПривязано = 0, "ЧИСЛО_ЦВКРАСНЫЙ_ТЕКСТ", "ЧИСЛО_ЦВ2");

	СтруктураИтогов = Новый Структура;
	Стр = СтрШаблон("<p>%1: %2 %3 %4 %5 %3</p>", 
						омСервер.Фрмт(НСтр("ru = 'Еще можно привязать'; en = 'You can also bind'"), "НАДПИСЬ_Ж"), 
					    омСервер.Фрмт(СуммаНеПривязано, ЦвОстатка),
					    омСервер.Фрмт(Валюта, "НАДПИСЬ_ЦВ2"),
	                    омСервер.Фрмт(НСтр("ru = 'из'; en = 'of'"), "НАДПИСЬ_Ж"),
					    омСервер.Фрмт(СуммаОбщая, "ЧИСЛО_ЦВ2")
						);
	СтруктураИтогов.Вставить("Итоги", Стр); 

	Элементы.ДекорацияИтого.Заголовок = Новый ФорматированнаяСтрока(ОбщегоНазначения.ТекстHTMLВФорматированнуюСтроку(СтруктураИтогов.Итоги));

КонецПроцедуры

&НаКлиенте
Процедура СохранитьВыбор(Команда)
	
	МассивИ = Новый Массив;
	Для Каждого строкаВ из Инвойсы Цикл
		//Если НЕ строкаВ.Долг = 0 Тогда 
		//Если строкаВ.Пометка Тогда 
			МассивИ.Добавить(строкаВ);
		//КонецЕсли;
	КонецЦикла;
	ЭтаФорма.Закрыть(МассивИ);

КонецПроцедуры

