#Область ДействияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ИмяДокумента = Объект.Ссылка.Метаданные().Синоним;  
	
	Элементы.ГруппаСостояние.Видимость = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОтображатьСостояниеВФормеДокумента");
	ОбщегоНазначения.ОтобразитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента); 


КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	клФормаДокументаПриОткрытии(ЭтаФорма, Объект);
	
    ОтобразитьИтоги();

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	клФормаДокументаПередЗаписью(Объект, Отказ);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
		
	ОбщегоНазначения.ОтобразитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента); 
	
КонецПроцедуры

#КонецОбласти 


#Область ДействияЭлементовФормы

&НаКлиенте
Процедура ИзБуфераОбмена(Команда)

	//Если ЭтаФорма.ТолькоПросмотр ИЛИ Объект.Окончательно Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//МоиИтоги();
	//Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
	
	//Если гоПЗ(Объект.Склад) Тогда клОшибка(НСтр("ru = 'Не задан склад!'; en = 'Store not specified!'")); Возврат; КонецЕсли; 
	//Если гоПЗ(Объект.Валюта) Тогда клОшибка(НСтр("ru = 'Не задана валюта!'; en = 'Currency not specified!'")); Возврат; КонецЕсли; 
	//
	//Если гоПЗ(Объект.Ссылка) Тогда МояЗаписать(Ложь) КонецЕсли; 
	
	Буф = РаботаСоСканеромШК.ПолучитьИМЕИИзБуфера();

	//если уже есть такой товар, зачем искать цену
	ЕстЦен = 0;
	Если Объект.Товары.Количество() <> 0 Тогда
		//Мас = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", НовНом));
		//Если Мас.Количество() <> 0 Тогда ЕстЦен = Мас[0].ЦенаПродажи КонецЕсли;
	КонецЕсли; 
	
	////2016.04.23
	//Если ЕстЦен <> 0 Тогда 
	//	НовЦен = ЕстЦен;
	//Иначе 
	//	НовЦен = 0;
	//	Если НЕ ВвестиЧисло(НовЦен, "Цена (0 - взять цены прихода)", 19, ЧислоЗнаковЦена) Тогда Возврат КонецЕсли;
	//КонецЕсли;
	
	НСтр = СтрЧислоСтрок(Буф);
	
	//тут должна быть одна колонка, после получения первого непустого значения (могут быть табуляции) - больше не ищем
	Для Н = 1 По НСтр Цикл
		СС = "";
		С = СтрПолучитьСтроку(Буф, Н);
		Пока (СС = "") И (С <> "") Цикл
			СС = гоСледПолеТаб(С);
		КонецЦикла; 
		//ЛюбаяСерия(СС);
	КонецЦикла;  
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьИтоги()

	СтруктураИтогов = омСервер.МоиИтогиФорматированные(Объект); 
	Элементы.ДекорацияИтого.Заголовок = Новый ФорматированнаяСтрока(ОбщегоНазначения.ТекстHTMLВФорматированнуюСтроку(СтруктураИтогов.Итоги));

КонецПроцедуры


#КонецОбласти 


#Область ДействияТабличнойЧасти

#КонецОбласти 
