Процедура ЗарегистрироватьДокументКПроведению(ДокументСсылка, Инициатор) Экспорт
	
	НовЗапись = РегистрыСведений.ДокументыКПроведению.СоздатьМенеджерЗаписи();
	Мен = РегистрыСведений.ДокументыКПроведению.СоздатьМенеджерЗаписи();		
	Мен.Документ 			= ДокументСсылка; 
	Мен.Инициатор 			= Инициатор; 
	Мен.Зарегистрировано 	= ТекущаяДатаСеанса();
	Мен.Записать();
	
КонецПроцедуры

   
Процедура ПроведениеДокументовПриЗаписи(Источник, Отказ) Экспорт
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ДвижениеДенег") Тогда
		Запр = Новый Запрос;  
		Запр.УстановитьПараметр("Ссылка", Источник.Ссылка);
		Запр.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		             |	ДвижениеДенегИнвойсы.Инвойс КАК Инвойс
		             |ИЗ
		             |	Документ.ДвижениеДенег.Инвойсы КАК ДвижениеДенегИнвойсы
		             |ГДЕ
		             |	ДвижениеДенегИнвойсы.Ссылка = &Ссылка
		             |	И ДвижениеДенегИнвойсы.Инвойс.Проведен";
		Выборка = Запр.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗарегистрироватьДокументКПроведению(Выборка.Инвойс, Источник.Ссылка);
		КонецЦикла;
	
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПроведениеДокументов() Экспорт

	Запр = Новый Запрос;
	Запр.Текст = "ВЫБРАТЬ
	             |	ДокументыКПроведению.Документ КАК Документ
	             |ИЗ
	             |	РегистрСведений.ДокументыКПроведению КАК ДокументыКПроведению
	             |ГДЕ
	             |	ДокументыКПроведению.Документ.Проведен"; 
	Выборка = Запр.Выполнить().Выбрать();    
	Пока Выборка.Следующий() Цикл
		
		ДокОбъект = Выборка.Документ.ПолучитьОбъект();
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);   
			НаборЗаписей = РегистрыСведений.ДокументыКПроведению.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Документ.Установить(Выборка.Документ);
			НаборЗаписей.Записать();
			гоЗаписьЖурналаРегистрации("Регламентное проведение", СтрЗаменить(ТипЗнч(Выборка.Документ), "ДокументСсылка.", ""), "Проведение", Выборка.Документ, );
		Исключение
			
		КонецПопытки;

	КонецЦикла;
	
	Последовательности.ПартииВалют.Восстановить();
	
КонецПроцедуры

