// © Primus1C  04.06.2025  НАЧАЛО ►

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если глЗапретЗаписиПоДате(Ссылка) Тогда Отказ = Истина; Возврат; КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(КемСоздан) Тогда КемСоздан = гоПользователь() КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(Создан) Тогда Создан = ТекущаяДата() КонецЕсли; 
	КемСохранен = гоПользователь();
	Сохранен = ТекущаяДата(); 
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
		
	КемСоздан = гоПользователь(); 
	Создан = ТекущаяДата(); 

КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄
