
&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Сформировать(Неопределено); 

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = СтрШаблон("%1 (%2 %3)",
							НСтр("ru = 'Контроль ввода данных'; en = 'Data entry control'"),
							НСтр("ru = 'с'; en = 'from'"),
							Формат(НачалоМесяца(ДобавитьМесяц(ТекущаяДатаСеанса(), -1)), "ДФ=dd.MM.yyyy"));
	//Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаНастройки.Видимость = Ложь;
	//Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаВарианты.Видимость = Ложь;

	// 1. Читаем исходный HTML из макета
	//ОбъектДанных = РеквизитФормыВЗначение("Объект"); 
    ОбъектДанных = РеквизитФормыВЗначение("Отчет"); 
    Макет = ОбъектДанных.ПолучитьМакет("МакетДашборда2"); 
    ТекстМакета = Макет.ПолучитьТекст();
    
    // 2. Генерируем текст с данными (обратите внимание: это просто текст!)
	Скрипт = "";
	// Пример: Индикатор заполнен на 85%, но выводится число 1250 
	//         Встречи заполнены на 60%, выводится число 34
	Скрипт = Скрипт + "UpdateIndicator(1, " + 
	"'Справочники', 85, '1 250', " + 
	"'Документы', 60, '34', " + 
	"'Регистры', 90, '8 100', " + 
	"'Планы видов', 40, '12', " + 
	"'', 0, '', " + 
	"'Индекс базы', '75%', '#888888', '#000000');" + Символы.ПС;
	
	// Пример: Если показателя нет, передаем пустые значения
	Скрипт = Скрипт + "UpdateIndicator(2, " + 
	"'Критичные', 10, '5 шт', " + 
	"'Предупреждения', 45, '12 шт', " + 
	"'', 0, '', " + 
	"'', 0, '', " +  
	"'', 0, '', " + 
	"'Статус', 'Тревога', '#FF0000', '#FF0000');" + Символы.ПС; 
	
	// 3. Вклеиваем наши данные внутрь HTML-кода    
    ГотовыйHTML = СтрЗаменить(ТекстМакета, "// %ВСТАВКА_ВЫЗОВОВ_ИЗ_1С%", Скрипт);
    
    // 4. Отдаем HTML на форму
    ЭтаФорма.ТекстHTML = ГотовыйHTML;

КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	СкомпоноватьРезультат(РежимКомпоновкиРезультата.Авто); 
	ПрочитатьТаблицуИОбновитьИндикаторы();
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьТаблицуИОбновитьИндикаторы()
	
	//ЦветОшибки = "#9a031e";
	ЦветОшибки 	= "#c1121f";
	ЦветОК 		= "#006400";
	ЦведПодписи = "#708090";
	
    Если ЗначениеЗаполнено(Отчет.АдресХранилищаТЗ) Тогда
		
		// Достаем готовую ТЗ из хранилища
		ТаблицаДанных = ПолучитьИзВременногоХранилища(Отчет.АдресХранилищаТЗ);
		
		ОбъектДанных = РеквизитФормыВЗначение("Отчет"); 
		ТекстМакета = ОбъектДанных.ПолучитьМакет("МакетДашборда2").ПолучитьТекст();
		
		// Формируем новые данные для индикаторов 
		СоставПоказателей = СоставПоказателей(ТаблицаДанных, "Номенклатура без веса", "Незашифр.поставщики", "Не проводятся");
		Скрипт = СтрШаблон("UpdateIndicator(1, %1 '%2', '%3', '%4', '%5');%6",
							СоставПоказателей.Показатели,
							"ТОВАРЫ И ДОКУМЕНТЫ",
		                    ?(СоставПоказателей.Ошибки=0, "Ок", "Ошибок: " + СоставПоказателей.Ошибки),
							ЦведПодписи,
							?(СоставПоказателей.Ошибки=0, ЦветОК, ЦветОшибки),
		                    Символы.ПС);          
		СоставПоказателей = СоставПоказателей(ТаблицаДанных, "Инвойсы без веса", "Прибывшие ивойсы", "Пересорт инвойс-приход", "Распределение отправок");
		Скрипт = Скрипт + СтрШаблон("UpdateIndicator(2, %1 '%2', '%3', '%4', '%5');%6",
							СоставПоказателей.Показатели,
							"ИНВОЙСЫ",
		                    ?(СоставПоказателей.Ошибки=0, "Ок", "Ошибок: " + СоставПоказателей.Ошибки),
							ЦведПодписи,
							?(СоставПоказателей.Ошибки=0, ЦветОК, ЦветОшибки),
		                    Символы.ПС);  
		СоставПоказателей = СоставПоказателей(ТаблицаДанных, "Приходные не Ок", "Перемещения не Ок", "Даты прих.накладных", "Доп.затраты");
		Скрипт = Скрипт + СтрШаблон("UpdateIndicator(3, %1 '%2', '%3', '%4', '%5');%6",
							СоставПоказателей.Показатели,
							"ЗАКУПКИ",
		                    ?(СоставПоказателей.Ошибки=0, "Ок", "Ошибок: " + СоставПоказателей.Ошибки),
							ЦведПодписи,
							?(СоставПоказателей.Ошибки=0, ЦветОК, ЦветОшибки),
		                    Символы.ПС);
		СоставПоказателей = СоставПоказателей(ТаблицаДанных, "Расходные не Ок", "Неадекватная наценка", "Цены возвратов");
		Скрипт = Скрипт + СтрШаблон("UpdateIndicator(4, %1 '%2', '%3', '%4', '%5');%6",
							СоставПоказателей.Показатели,
							"ПРОДАЖИ",
		                    ?(СоставПоказателей.Ошибки=0, "Ок", "Ошибок: " + СоставПоказателей.Ошибки),
							ЦведПодписи,
							?(СоставПоказателей.Ошибки=0, ЦветОК, ЦветОшибки),
		                    Символы.ПС);    
		СоставПоказателей = СоставПоказателей(ТаблицаДанных, "Движения денег не Ок", "Привязки инвойсов", "Неверная валюта");
		Скрипт = Скрипт + СтрШаблон("UpdateIndicator(5, %1 '%2', '%3', '%4', '%5');",
							СоставПоказателей.Показатели,
							"ОПЛАТЫ",
		                    ?(СоставПоказателей.Ошибки=0, "Ок", "Ошибок: " + СоставПоказателей.Ошибки),
							ЦведПодписи,
							?(СоставПоказателей.Ошибки=0, ЦветОК, ЦветОшибки)
		                    );
							
		ЭтаФорма.ТекстHTML = СтрЗаменить(ТекстМакета, "// %ВСТАВКА_ВЫЗОВОВ_ИЗ_1С%", Скрипт);  
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СоставПоказателей(тз, Тэг1, Тэг2 = "", Тэг3 = "", Тэг4 = "", Тэг5 = "")
	
	Строк1 = тз.НайтиСтроки(Новый Структура("Тэг", Тэг1)).Количество();
	Строк2 = тз.НайтиСтроки(Новый Структура("Тэг", Тэг2)).Количество();
	Строк3 = тз.НайтиСтроки(Новый Структура("Тэг", Тэг3)).Количество();
	Строк4 = тз.НайтиСтроки(Новый Структура("Тэг", Тэг4)).Количество();
	Строк5 = тз.НайтиСтроки(Новый Структура("Тэг", Тэг5)).Количество();
	МаксСтрок = Макс(Строк1, Строк2, Строк3, Строк4, Строк5);
	
	стр1 = ПодстрокаПоказателя(Тэг1, Строк1, МаксСтрок);
	стр2 = ПодстрокаПоказателя(Тэг2, Строк2, МаксСтрок);
	стр3 = ПодстрокаПоказателя(Тэг3, Строк3, МаксСтрок);
	стр4 = ПодстрокаПоказателя(Тэг4, Строк4, МаксСтрок);
	стр5 = ПодстрокаПоказателя(Тэг5, Строк5, МаксСтрок);
	
	Возврат Новый Структура("Показатели, Ошибки", стр1 + стр2 + стр3 + стр4 + Стр5, Строк1 + Строк2 + Строк3 + Строк4 + Строк5);
	
КонецФункции 

&НаСервере
Функция ПодстрокаПоказателя(Тэг, Строк, СтрокВсего)
	
	Если Тэг = "" Тогда
		Возврат "'', 0, '', "; 
	ИначеЕсли СтрокВсего = 0 Тогда
		Возврат СтрШаблон("'%1', %2, '%3', ", Тэг, 0, 0);
	Иначе	
	    Возврат СтрШаблон("'%1', %2, '%3', ", Тэг, Окр(Строк/СтрокВсего*100), Строк);
	КонецЕсли;

КонецФункции	

&НаКлиенте
Процедура ТекстHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры
