// © Primus1C  12.04.2024  НАЧАЛО ►

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(КемСоздан) Тогда КемСоздан = гоПользователь() КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(Создан) Тогда Создан = ТекущаяДата() КонецЕсли; 
	КемСохранен = гоПользователь();
	Сохранен = ТекущаяДата();

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Фирма 		= гоФирма();
	КемСоздан 	= гоПользователь(); 
	Создан 		= ТекущаяДатаСеанса(); 

	Валюта = ПараметрыСеанса.ВалютаУстановкиЦенПродажи;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если НЕ Отказ Тогда
		
		Запр = Новый Запрос; 
		Запр.УстановитьПараметр("Ссылка", Ссылка);  
		
		Запр.Текст = "ВЫБРАТЬ
		             |	УстЦен.Номенклатура КАК Номенклатура,
		             |	УстЦен.ВидЦены КАК ВидЦены,
		             |	СУММА(УстЦен.Цена) КАК Цена,
		             |	СУММА(УстЦен.ЦенаОтКоличества) КАК ЦенаОтКоличества,
		             |	СУММА(УстЦен.Количество) КАК Количество,
		             |	СРЕДНЕЕ(УстЦен.РазрешитьПродажу) КАК РазрешитьПродажу
		             |ИЗ
		             |	(ВЫБРАТЬ
		             |		УстановкаЦенТовары.Номенклатура КАК Номенклатура,
		             |		УстановкаЦенТовары.ВидЦены КАК ВидЦены,
		             |		ВЫБОР
		             |			КОГДА УстановкаЦенТовары.Количество = -1
		             |				ТОГДА УстановкаЦенТовары.Цена
		             |			ИНАЧЕ 0
		             |		КОНЕЦ КАК Цена,
		             |		ВЫБОР
		             |			КОГДА УстановкаЦенТовары.Количество = -1
		             |				ТОГДА 0
		             |			ИНАЧЕ УстановкаЦенТовары.Цена
		             |		КОНЕЦ КАК ЦенаОтКоличества,
		             |		ВЫБОР
		             |			КОГДА УстановкаЦенТовары.Количество = -1
		             |				ТОГДА 0
		             |			ИНАЧЕ УстановкаЦенТовары.Количество
		             |		КОНЕЦ КАК Количество,
		             |		УстановкаЦенТовары.РазрешитьПродажу КАК РазрешитьПродажу
		             |	ИЗ
		             |		Документ.УстановкаЦен.Товары КАК УстановкаЦенТовары
		             |	ГДЕ
		             |		УстановкаЦенТовары.Ссылка = &Ссылка) КАК УстЦен
		             |
		             |СГРУППИРОВАТЬ ПО
		             |	УстЦен.Номенклатура,
		             |	УстЦен.ВидЦены";
		Выборка = Запр.Выполнить().Выбрать(); 
		
		Движения.ЦеныПродажи.Записывать = Истина;
		
		Пока Выборка.Следующий() Цикл
			Движение = Движения.ЦеныПродажи.Добавить(); 
			ЗаполнитьЗначенияСвойств(Движение, Выборка);
			Движение.Период = Дата;
			Движение.Валюта	= Валюта;
		КонецЦикла;
		
		Движения.ЦеныПродажи.Записать();
		
	КонецЕсли;   
	
КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄
