// © Primus1C  12.04.2024  НАЧАЛО ►

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если глЗапретЗаписиПоДате(Ссылка) Тогда Отказ = Истина; Возврат; КонецЕсли;
	
	омСервер.ЗаписатьОбщиеРеквизиты(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ОбщегоНазначенияСервер.ЗаполнитьРеквизитыДокументаПоУмолчанию(ЭтотОбъект);

	Склад = ПараметрыСеанса.ВалютаУстановкиЦенПродажи;
	
КонецПроцедуры

Процедура ПроверкаЗаполнения(Отказ)
	
	Ошибки = Новый СписокЗначений;
	//ПроведениеДокументов.ПроверитьДубли(Товары, Ошибки, "Номенклатура");  // проверка на дубли производится в форме ПерезЗаписью()
	Для каждого Ош Из Ошибки Цикл
		Сообщить(Ош.Значение);
		Отказ = Истина;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроверкаЗаполнения(Отказ);
	Если Отказ Тогда
		Возврат;	
	КонецЕсли;

	Запр = Новый Запрос; 
	Запр.УстановитьПараметр("Ссылка", Ссылка);  
	
	Запр.Текст = "ВЫБРАТЬ
	             |	УстЦен.Номенклатура КАК Номенклатура,
	             |	УстЦен.ВидЦены КАК ВидЦены,
	             |	УстЦен.ВидЦены.Валюта КАК Валюта,
	             |	СУММА(УстЦен.Цена) КАК Цена,
	             |	СУММА(УстЦен.ЦенаОтКоличества) КАК ЦенаОтКоличества,
	             |	СУММА(УстЦен.Количество) КАК Количество,
	             |	СРЕДНЕЕ(УстЦен.РазрешитьПродажу) КАК РазрешитьПродажу,
	             |	УстЦен.Склад КАК Склад
	             |ИЗ
	             |	(ВЫБРАТЬ
	             |		УстановкаЦенТовары.Ссылка.Склад КАК Склад,
	             |		УстановкаЦенТовары.Номенклатура КАК Номенклатура,
	             |		УстановкаЦенТовары.ВидЦены КАК ВидЦены,
	             |		ВЫБОР
	             |			КОГДА УстановкаЦенТовары.Количество = -1
	             |				ТОГДА УстановкаЦенТовары.Цена
	             |			ИНАЧЕ 0
	             |		КОНЕЦ КАК Цена,
	             |		ВЫБОР
	             |			КОГДА УстановкаЦенТовары.Количество = -1
	             |				ТОГДА 0
	             |			ИНАЧЕ УстановкаЦенТовары.Цена
	             |		КОНЕЦ КАК ЦенаОтКоличества,
	             |		ВЫБОР
	             |			КОГДА УстановкаЦенТовары.Количество = -1
	             |				ТОГДА 0
	             |			ИНАЧЕ УстановкаЦенТовары.Количество
	             |		КОНЕЦ КАК Количество,
	             |		УстановкаЦенТовары.РазрешитьПродажу КАК РазрешитьПродажу
	             |	ИЗ
	             |		Документ.УстановкаЦен.Товары КАК УстановкаЦенТовары
	             |	ГДЕ
	             |		УстановкаЦенТовары.Ссылка = &Ссылка
	             |		И УстановкаЦенТовары.Цена > 0) КАК УстЦен
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	УстЦен.Номенклатура,
	             |	УстЦен.ВидЦены,
	             |	УстЦен.ВидЦены.Валюта,
	             |	УстЦен.Склад";
	Выборка = Запр.Выполнить().Выбрать(); 
	
	Движения.ЦеныПродажи.Записывать = Истина;
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ЦеныПродажи.Добавить(); 
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		Движение.Период = Дата;
	КонецЦикла;
	
	Движения.ЦеныПродажи.Записать();
	
КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄
