// © Primus1C  12.04.2024  НАЧАЛО ►

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если глЗапретЗаписиПоДате(Ссылка) Тогда Отказ = Истина; Возврат; КонецЕсли;
	
	омСервер.ЗаписатьОбщиеРеквизиты(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ОбщегоНазначенияСервер.ЗаполнитьРеквизитыДокументаПоУмолчанию(ЭтотОбъект);

	Склад = ПараметрыСеанса.Склад;
	
	Выборка = Справочники.ВидыЦен.Выбрать(Новый Структура("ПометкаУдаления", Ложь));
	Пока Выборка.следующий() Цикл
		НовСтрокаТЧ = ВидыЦен.Добавить();
		НовСтрокаТЧ.ВидЦены = Выборка.Ссылка;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверкаЗаполнения(Отказ)
	
	Ошибки = Новый СписокЗначений;
	//ПроведениеДокументов.ПроверитьДубли(Товары, Ошибки, "Номенклатура");  // проверка на дубли производится в форме ПерезЗаписью()
	Для каждого Ош Из Ошибки Цикл
		Сообщить(Ош.Значение);
		Отказ = Истина;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроверкаЗаполнения(Отказ);
	Если Отказ Тогда
		Возврат;	
	КонецЕсли;

	Запр = Новый Запрос; 
	Запр.УстановитьПараметр("Ссылка", Ссылка);  
	
	Запр.Текст = "ВЫБРАТЬ
	             |	УстановкаЦенТовары.Ссылка.Дата КАК Период,
	             |	УстановкаЦенТовары.Номенклатура КАК Номенклатура,
	             |	УстановкаЦенТовары.ВидЦены КАК ВидЦены,
	             |	УстановкаЦенТовары.Цена0 КАК Цена0,
	             |	УстановкаЦенТовары.Цена1 КАК Цена1,
	             |	УстановкаЦенТовары.Порог1 КАК Порог1,
	             |	УстановкаЦенТовары.Цена2 КАК Цена2,
	             |	УстановкаЦенТовары.Порог2 КАК Порог2,
	             |	УстановкаЦенТовары.Цена3 КАК Цена3,
	             |	УстановкаЦенТовары.Порог3 КАК Порог3,
	             |	УстановкаЦенТовары.РазрешитьПродажу КАК РазрешитьПродажу,
	             |	УстановкаЦенТовары.Ссылка.Склад КАК Склад
	             |ИЗ
	             |	Документ.УстановкаЦен.Товары КАК УстановкаЦенТовары
	             |ГДЕ
	             |	УстановкаЦенТовары.Ссылка = &Ссылка";
	Выборка = Запр.Выполнить().Выбрать(); 
	
	Движения.ЦеныПродажи.Записывать = Истина;
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ЦеныПродажи.Добавить(); 
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		//Движение.Период = Дата;
	КонецЦикла;
	
	Движения.ЦеныПродажи.Записать();
	
КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄
