// © Primus1C  13.12.2023  НАЧАЛО ►

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//Если ЭтоНовый() ИЛИ Лев(Номер,2) <> Фирма.Префикс Тогда
	//УстановитьНовыйНомер(Фирма.Префикс + "-" + формат(дата, "ДФ=yyyyMMdd") + "-");
	//КонецЕсли;   
	
	Сумма = Товары.Итог("Сумма") + Доставка;
	Количество = Товары.Итог("Количество");
	
    омСервер.ЗаписатьОбщиеРеквизиты(ЭтотОбъект);
	
КонецПроцедуры


Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	//Если ЗначениеЗаполнено(Контрагент.Префикс) Тогда
	//	Префикс = СокрЛП(Контрагент.Префикс);  
	//КонецЕсли;  
	
	Префикс = Фирма.Префикс + "-" + формат(дата, "ДФ=yyyyMMdd") + "-";

КонецПроцедуры

Процедура ПроверитьВозможностьПроведения(Отказ)

	Если РезервироватьТовар Тогда
		Если НЕ ЗначениеЗаполнено(Склад) Тогда
			Отказ = Истина;	
			Сообщить(НСтр("ru = 'Не заполнен склад резервирования!'; en = 'The Store not filled in !'"));
		КонецЕсли;
	КонецЕсли;  
	Если Товары.Количество() = 0 Тогда
		Отказ = Истина;	
	КонецЕсли;
	
КонецПроцедуры	
	
Процедура ОбработкаПроведения(Отказ, Режим)
	
	ПроверитьВозможностьПроведения(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// регистр ТоварыВДороге Приход
	Движения.ТоварыВДороге.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ТоварыВДороге.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ВидДороги = Перечисления.ВидДороги.Резерв;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄
