#Область ДействияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ИмяДокумента = Объект.Ссылка.Метаданные().Синоним;  
	
	Элементы.ГруппаСостояние.Видимость = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОтображатьСостояниеВФормеДокумента");
	ОбщегоНазначения.ОтобразитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента); 

 	Элементы.Валюта.БыстрыйВыбор = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("БыстрыйВыборВалют"); 
    ЗаполнитьКэшДанных();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	клФормаДокументаПриОткрытии(ЭтаФорма, Объект);
	
	мСканерШК.СканерШКПодключить();  
	ОтобразитьЦветВалюты();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	клФормаДокументаПередЗаписью(Объект, Отказ);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
		
	ОбщегоНазначения.ОтобразитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента); 
	
КонецПроцедуры

 &НаСервере
 Процедура ЗаполнитьКэшДанных()
	 
	 КэшДанных = Новый Структура;
	 КэшДанных.Вставить("РаскрашиватьВалюты", ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("РаскрашиватьВалюты"));
	 КэшДанных.Вставить("ЦветаВалют", ОбщегоНазначенияПовтИсп.ЦветаВалют());
	 
 КонецПроцедуры 
 
#КонецОбласти 


#Область ДействияЭлементовФормы

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)

	ОтобразитьЦветВалюты();

КонецПроцедуры
 
 &НаКлиенте
Процедура ОтобразитьЦветВалюты() 
	
	Если КэшДанных.РаскрашиватьВалюты Тогда
		Элементы.Валюта.ЦветФона = КэшДанных.ЦветаВалют.Получить(Объект.Валюта);
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура РучнойШКПриИзменении(Элемент)
	
	ЛюбаяСерия(РучнойШК, Истина);

КонецПроцедуры

#КонецОбласти 


#Область РаботаСоШтрихкодом

&НаКлиенте
Процедура ЛюбаяСерия(ШК, СтатьНаРучной = Ложь) 
	
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли; 
	//Если Объект.Окончательно Тогда Возврат КонецЕсли; 
	
	//МоиИтоги(Объект.Товары.Количество()-1);
	//Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
	
	Если гоПЗ(Объект.Склад) Тогда клОшибка("Не задан склад ОТКУДА!"); Возврат; КонецЕсли; 
	Если гоПЗ(Объект.Валюта) Тогда клОшибка("Не задана валюта!"); Возврат; КонецЕсли; 
	
	//Если гоПЗ(Объект.Ссылка) Тогда МояЗаписать(Ложь) КонецЕсли; 
	
	//по идее, нужно найти товар с такой серией и передать его в добавление строки, зачем изобретать велосипед?
	СпиПар = омСервер.ПартииПоСерииОстатки(ШК, Объект.Фирма, Объект.Склад);
	
	Ско = СпиПар.Количество();
	ТекПар = 0;
	Если Ско  = 0 Тогда
		Сигнал();
		клОшибка("Нет остатков по серии: " + ШК + "!");
		Возврат;
	ИначеЕсли Ско > 1 Тогда
		Сигнал();
		Эле = СпиПар.ВыбратьЭлемент("Найдено несколько партий с такой серией, выберите:");
		Если Эле = Неопределено Тогда Возврат КонецЕсли;
		ТекПар = Эле.Значение;
	Иначе
		ТекПар = СпиПар[0].Значение;
	КонецЕсли; 
	Если ТекПар = 0 Тогда Возврат КонецЕсли; 
	
	НовКол = 1;
	НовНом = гоРеквизит(ТекПар, "Владелец");
	
	НовСтр = Объект.Товары.Добавить();
	
	НовСтр.Номенклатура = НовНом;
	НовСтр.Партия = ТекПар;
	НовСтр.Количество = НовКол;
	
	ИДИ = НовСтр.ПолучитьИдентификатор();
	
	//МояЗаписать(Ложь);
	
	//гоЗаписьЖурналаРегистрации(ШК + "|" + Строка(НовКол) + "|" + гоИмя(НовНом, Ложь), ИмяДокумента + ?(Объект.Окончательно, "ПослеОкончательно", ""), "Добавление строки", Объект.Ссылка, 2);
	
	Элементы.Товары.ТекущаяСтрока = ИДИ;
	
	Если СтатьНаРучной Тогда 
		РучнойШК = "";
		ПодключитьОбработчикОжидания("МоеОжидание", 0.1, Истина);
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура МоеОжидание()
	
	ЭтаФорма.ТекущийЭлемент = Элементы.РучнойШК;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзБуфераОбмена(Команда)

	//Если ЭтаФорма.ТолькоПросмотр ИЛИ Объект.Окончательно Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//МоиИтоги();
	//Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
	
	//Если гоПЗ(Объект.Склад) Тогда клОшибка(НСтр("ru = 'Не задан склад!'; en = 'Store not specified!'")); Возврат; КонецЕсли; 
	//Если гоПЗ(Объект.Валюта) Тогда клОшибка(НСтр("ru = 'Не задана валюта!'; en = 'Currency not specified!'")); Возврат; КонецЕсли; 
	//
	//Если гоПЗ(Объект.Ссылка) Тогда МояЗаписать(Ложь) КонецЕсли; 
	
	Попытка
		WSHShell = Новый COMОбъект("WScript.Shell");
		WSHShell.SendKeys("^V");
	Исключение
	    //ОписаниеОшибки()
	КонецПопытки; 
	
	Буф = "";
	Если НЕ ВвестиСтроку(Буф, "Вставьте (если пусто) серии (CTRL+V) и нажмите ОК", , Истина) Тогда Возврат КонецЕсли;
	
	//2016.04.20
	Буф = омСервер.ОставитьТолькоИМЕИ(Буф);
	
	//2016.04.23
	//если уже есть такой товар, зачем искать цену
	ЕстЦен = 0;
	Если Объект.Товары.Количество() <> 0 Тогда
		Мас = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", НовНом));
		Если Мас.Количество() <> 0 Тогда ЕстЦен = Мас[0].ЦенаПродажи КонецЕсли;
	КонецЕсли; 
	
	////2016.04.23
	//Если ЕстЦен <> 0 Тогда 
	//	НовЦен = ЕстЦен;
	//Иначе 
	//	НовЦен = 0;
	//	Если НЕ ВвестиЧисло(НовЦен, "Цена (0 - взять цены прихода)", 19, ЧислоЗнаковЦена) Тогда Возврат КонецЕсли;
	//КонецЕсли;
	
	НСтр = СтрЧислоСтрок(Буф);
	
	//тут должна быть одна колонка, после получения первого непустого значения (могут быть табуляции) - больше не ищем
	Для Н = 1 По НСтр Цикл
		СС = "";
		С = СтрПолучитьСтроку(Буф, Н);
		Пока (СС = "") И (С <> "") Цикл
			СС = гоСледПолеТаб(С);
		КонецЦикла; 
		ЛюбаяСерия(СС);
	КонецЦикла;  
	
КонецПроцедуры


#КонецОбласти              


#Область ДействияТабличнойЧасти

#КонецОбласти 
