&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Фирма.Видимость = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Запись.Фирма) Тогда Запись.Фирма = гоФирма() КонецЕсли;     
	
	// © Primus1C  06.07.2023  НАЧАЛО ► 
	ОтобразитьБазовуюВалюту();
	// © Primus1C  ОКОНЧАНИЕ ◄

КонецПроцедуры

// © Primus1C  06.07.2023  НАЧАЛО ►

&НаСервере
Процедура ОтобразитьБазовуюВалюту()

	БазоваяВалюта = Запись.Валюта.БазоваяВалюта;
	Если НЕ ЗначениеЗаполнено(БазоваяВалюта) Тогда
		БазоваяВалюта = Запись.Фирма.Валюта;	
	КонецЕсли;

КонецПроцедуры	


&НаКлиенте
Процедура ФирмаПриИзменении(Элемент)
	
	ОтобразитьБазовуюВалюту();
	
КонецПроцедуры


&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	ОтобразитьБазовуюВалюту();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)


КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)


КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	Запись.КурсОбратный = 1 / Запись.Курс;

КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄