&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Элементы.Фирма.Видимость = Ложь;
	
	Попытка
		ЭтаФорма.Элементы.ФормаИзменитьФорму.Видимость = Ложь;
		ЭтаФорма.Элементы.ФормаНастройкаСписка.Видимость = Ложь;
		
		ЭтаФорма.Элементы.ФормаОбновить.ТолькоВоВсехДействиях = Ложь;
		ЭтаФорма.Элементы.ФормаОбновить.Отображение = ОтображениеКнопки.КартинкаИТекст;
	Исключение
	КонецПопытки; 
	
	//гоСтандартныйОтбор(Список, 0, Истина, гоФирма());

	// © Primus1C  11.11.2023  НАЧАЛО ► 
	Если Параметры.Свойство("Валюта") Тогда
		//гоСтандартныйОтбор(Список, 1, Истина, Параметры.Валюта);  
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование 	= Истина;
		ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Валюта");
		ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение 	= Параметры.Валюта;
	КонецЕсли;   
	глПокраситьВалюты(ЭтаФорма, "Валюта");
	// © Primus1C  ОКОНЧАНИЕ ◄

КонецПроцедуры
