
&НаКлиенте
Процедура СгенерироватьТокен(Команда)
	
	Если ЗначениеЗаполнено(Объект.ТокенАвторизации) Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПодтвержденияГенерации", ЭтаФорма);
		ПоказатьВопрос(ОписаниеОповещения, "Токен уже существует. Сгенерировать новый? Доступ по старому токену будет закрыт.", РежимДиалогаВопрос.ДаНет);
	Иначе
		Объект.ТокенАвторизации = StockAPI_Утилиты.СгенерироватьТокенSHA256();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодтвержденияГенерации(Результат, Параметры) Экспорт  
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.ТокенАвторизации = StockAPI_Утилиты.СгенерироватьТокенSHA256();
	КонецЕсли;
	
КонецПроцедуры
