
Процедура ПослеВыбораЭлементаСтатусаИнвойсовПродажи(ВыбранныйЭлемент, СписокПараметров) Экспорт 
	
    Если ВыбранныйЭлемент = Неопределено Тогда
        Возврат;
	КонецЕсли; 
	
	Ошибка = Ложь;   
	Загл = "Статус";
    РаботаСИнвойсами.ЗаписатьСтатусИнвойсаПродажи(СписокПараметров.Ссылка, ВыбранныйЭлемент.Значение, , Ошибка);      
	Если Ошибка Тогда
		клНамекнуть(Загл, стрШаблон("Не удалось установить статус: %1", СписокПараметров.Ссылка), БиблиотекаКартинок.ВниманиеКрасный); 
	Иначе
		клНамекнуть(Загл, стрШаблон("%1: установлен статус %2", СписокПараметров.Ссылка, ВыбранныйЭлемент.Значение), БиблиотекаКартинок.Информация);
    	// === ОБНОВЛЕНИЕ ДИНАМИЧЕСКОГО СПИСКА НА ФОРМЕ ===
		Форма = СписокПараметров.ФормаИсточник;
		Если ТипЗнч(Форма) = Тип("УправляемаяФорма") Тогда
			Если Форма.Элементы.Найти("Список") <> Неопределено Тогда
				Форма.Элементы.Список.Обновить();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
