// © Primus1C  25.07.2023  НАЧАЛО ►

//Процедура ОтобразитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение) Экспорт
//	
//	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
//		
//		СостояниеДокумента			= НСтр("ru = 'Новый'; en = 'New'"); 
//		КартинкаСостоянияДокумента	= 4;
//		
//	Иначе
//		
//		Если Объект.Проведен Тогда
//			СостояниеДокумента 			=  НСтр("ru = 'Проведен'; en = 'Posted'");
//			КартинкаСостоянияДокумента	= 0;
//			
//		ИначеЕсли Объект.ПометкаУдаления Тогда
//			СостояниеДокумента 			= НСтр("ru = 'Помечен на удаление'; en = 'Marked as deleted'");
//			КартинкаСостоянияДокумента	= 2;   
//			
//		ИначеЕсли РазрешеноПроведение Тогда
//			СостояниеДокумента 			= НСтр("ru = 'Не проведен'; en = 'Not posted'");
//			КартинкаСостоянияДокумента	= 1;
//			
//		Иначе
//			СостояниеДокумента 			= НСтр("ru = 'Записан'; en = 'Saved'");
//			КартинкаСостоянияДокумента	= 1;
//			
//		КонецЕсли;
//		
//	КонецЕсли;
//	
//КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄