
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Номенклатура = Параметры.Номенклатура;  
	Если Параметры.Свойство("СформироватьПриОткрытии") Тогда
		СформироватьПриОткрытии =	Параметры.СформироватьПриОткрытии;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПоказатьЦеныНаСервере()
	
	ДиаграммаЦен.Обновление = Ложь;
	ДиаграммаЦен.Очистить();
	ДиаграммаЦен.АвтоТранспонирование = Ложь;
	ДиаграммаЦен.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки, -1);
	
	ЗапрМин = Новый Запрос;  
	ЗапрМин.УстановитьПараметр("Номенклатура",  Номенклатура); 
	ЗапрМин.УстановитьПараметр("Валюта", 		Валюта); 
	ЗапрМин.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	                |	НАЧАЛОПЕРИОДА(ЦеныЗакупки.Период, ДЕНЬ) КАК Дата
	                |ИЗ
	                |	РегистрСведений.ЦеныЗакупки КАК ЦеныЗакупки
	                |ГДЕ
	                |	ЦеныЗакупки.Номенклатура = &Номенклатура
	                |	И ЦеныЗакупки.Валюта = &Валюта
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	Дата";
	ВыборкаМин = ЗапрМин.Выполнить().Выбрать();	
	Если ВыборкаМин.Следующий() Тогда
	    НачалоПериода = ВыборкаМин.Дата;
	Иначе	
		НачалоПериода = Дата(2016, 4, 1);	
	КонецЕсли;
	
	Запр = Новый Запрос;  
	Запр.УстановитьПараметр("Номенклатура",  Номенклатура); 
	Запр.УстановитьПараметр("НачалоПериода", НачалоПериода); 
	Запр.УстановитьПараметр("Валюта", 		 Валюта); 
	Запр.Текст = "ВЫБРАТЬ
	             |	ЦеныЗакупкиСрезПервых.Номенклатура,
	             |	ЦеныЗакупкиСрезПервых.Поставщик,
	             |	ЦеныЗакупкиСрезПервых.Цена,
	             |	ЦеныЗакупкиСрезПервых.Регистратор,
	             |	ЦеныЗакупкиСрезПервых.Регистратор.Валюта КАК Валюта,
	             |	&НачалоПериода КАК Период
	             |ИЗ
	             |	РегистрСведений.ЦеныЗакупки.СрезПервых(
	             |			&НачалоПериода,
	             |			Номенклатура = &Номенклатура
	             |				И Валюта = &Валюта) КАК ЦеныЗакупкиСрезПервых
	             |
	             |ОБЪЕДИНИТЬ
	             |
	             |ВЫБРАТЬ
	             |	ЦеныЗакупки.Номенклатура,
	             |	ЦеныЗакупки.Поставщик,
	             |	ЦеныЗакупки.Цена,
	             |	ЦеныЗакупки.Регистратор,
	             |	ЦеныЗакупки.Регистратор.Валюта,
	             |	НАЧАЛОПЕРИОДА(ЦеныЗакупки.Период, ДЕНЬ)
	             |ИЗ
	             |	РегистрСведений.ЦеныЗакупки КАК ЦеныЗакупки
	             |ГДЕ
	             |	ЦеныЗакупки.Номенклатура = &Номенклатура
	             |	И ЦеныЗакупки.Валюта = &Валюта
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Период"; 
	
	МаксЗначение = 0;
	МинЗначение = 1000000000;

	Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		Серия = ДиаграммаЦен.УстановитьСерию(Строка(Выборка.Поставщик));
		//Серия.Цвет = Обработки.УдалитьМониторыРуководителя.ЦветДляМониторов("Синий");
		//Серия.Линия = Новый Линия(ТипЛинииДиаграммы.Сплошная, 2);
		//Серия.Маркер = ТипМаркераДиаграммы.Нет;
		
		Точка = ДиаграммаЦен.УстановитьТочку(Формат(Выборка.Период,"ДФ=dd.MM.yy"));
		Точка.Расшифровка = Выборка.Цена; 
		Подсказка = СтрШаблон("%1 %2
							|%3 
							|%4",
							Выборка.Цена, Валюта.Символ, Выборка.Регистратор, Выборка.Поставщик);
		
		ДиаграммаЦен.УстановитьЗначение(Точка, Серия, Выборка.Цена, Точка.Расшифровка, Подсказка);
		
		//Выборка = ВыборкаПоставщик.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		//Пока Выборка.Следующий() Цикл
		//	
		//	лДата = НачалоДня(Выборка.Регистратор.Дата);
		//	ИндексТочки = МассивТочек.Найти(лДата);
		//	Точка = ДиаграммаЦен.Точки.Получить(ИндексТочки);
		//	//Точка.Текст = Формат(лДата, "ДФ=dd.MM.yy");
		//	//Точка.Расшифровка = Регистратор.Дата;  
		//	Точка.Расшифровка = Выборка.Регистратор;
		//	//Подсказка = ?(ПрибыльУбыток < 0, НСтр("ru='Убыток ';uk='Збиток '") + -ПрибыльУбыток, НСтр("ru='Прибыль ';uk='Прибуток '") + ПрибыльУбыток) + " на " + Формат(Выборка.Период, "ДФ=dd.MM.yyyy");
		//	Подсказка = Выборка.Регистратор;
		//	ДиаграммаЦен.УстановитьЗначение(Точка, Серия, Выборка.Цена, Точка.Расшифровка, Подсказка);
		//	
			Цена = Выборка.Цена;
			Если Цена > МаксЗначение Тогда
				МаксЗначение = Цена;
			ИначеЕсли Цена < МинЗначение Тогда
				МинЗначение = Цена;
			КонецЕсли;

		//	Сообщить(Строка(ВыборкаПоставщик.Поставщик) + ": "+ Точка.Текст);

		//КонецЦикла;
		
	
	КонецЦикла; 
	
	
	////ДиаграммаЦен.МаксимальноеЗначение = Макс(Макс(МаксЗначение, -МаксЗначение), Макс(МинЗначение, -МинЗначение));
	////ДиаграммаЦен.МинимальноеЗначение = -ДиаграммаЦен.МаксимальноеЗначение;
	//
	////ДиаграммаЦен.АвтоМаксимальноеЗначение = Ложь;
	ДиаграммаЦен.АвтоМинимальноеЗначение = Ложь;
	ДиаграммаЦен.МинимальноеЗначение	= Окр(МинЗначение * 0.95, -2);
	////ДиаграммаЦен.МаксимальноеЗначение 	= Окр(ВыборкаГраниц.ЦенаМакс * 1.2, -2);
	//ДиаграммаЦен.БазовоеЗначение = Окр(ВыборкаГраниц.ЦенаМин * 0.6, -2);
	                                                                  
	ДиаграммаЦен.АвтоТранспонирование = Истина;
	ДиаграммаЦен.Обновление = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьЦены(Команда)
	ПоказатьЦеныНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРСПоПриходнымНаСервере(Ном)
	
	Запр = Новый Запрос;    
	Запр.УстановитьПараметр("Номенклатура", Номенклатура);
	Запр.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ПриходнаяНакладнаяТовары.Ссылка КАК Регистратор,
	             |	ПриходнаяНакладнаяТовары.Номенклатура КАК Номенклатура,
	             |	ПриходнаяНакладнаяТовары.ЦенаЗакупки КАК ЦенаЗакупки
	             |ИЗ
	             |	Документ.ПриходнаяНакладная.Товары КАК ПриходнаяНакладнаяТовары
	             |ГДЕ
	             |	ПриходнаяНакладнаяТовары.Ссылка В
	             |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |				ПНТовары.Ссылка
	             |			ИЗ
	             |				Документ.ПриходнаяНакладная.Товары КАК ПНТовары
	             |			ГДЕ
	             |				ПНТовары.Ссылка.Проведен
	             |				И ПНТовары.Ссылка.Окончательно
	             |				И ПНТовары.Номенклатура = &Номенклатура)
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	ПриходнаяНакладнаяТовары.Ссылка.Дата,
	             |	Номенклатура
	             |ИТОГИ
	             |	СРЕДНЕЕ(ЦенаЗакупки)
	             |ПО
	             |	Регистратор,
	             |	Номенклатура";	
	ВыборкаР = Запр.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаР.Следующий() Цикл 
		НаборЗаписей = РегистрыСведений.ЦеныЗакупки.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаР.Регистратор); 
		лДата 		= ВыборкаР.Регистратор.Дата;
		лВалюта 	= ВыборкаР.Регистратор.Валюта; 
		лПоставщик 	= ВыборкаР.Регистратор.Контрагент;
		//Сообщить("==============================");
		//Сообщить(ВыборкаР.Регистратор);
		ВыборкаН = ВыборкаР.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаН.Следующий() Цикл
			НоваяЗапись = НаборЗаписей.Добавить(); 
			НоваяЗапись.Регистратор 	= ВыборкаР.Регистратор;
			НоваяЗапись.Номенклатура	= ВыборкаН.Номенклатура;	
			НоваяЗапись.Поставщик		= лПоставщик;	
			НоваяЗапись.Цена			= ВыборкаН.ЦенаЗакупки;  
			НоваяЗапись.Валюта			= лВалюта;  
			НоваяЗапись.Период			= лДата;
			//Сообщить(СтрШаблон("   %1 (%2)", ВыборкаН.Номенклатура, лПоставщик));
		КонецЦикла; 
		//Сообщить("   = " + ВыборкаН.Количество());
		НаборЗаписей.Записать(Истина);
		Ном = Ном + 1; 
		
		//Прервать;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРСПоПриходным(Команда)
	Ном = 0;
	ЗаполнитьРСПоПриходнымНаСервере(Ном); 
	Сообщить("Добавлено записей: "+Ном);
КонецПроцедуры

&НаСервере
Процедура ОчиститьРСНаСервере(Ном)  
	
	Запр = Новый Запрос;     
	Запр.УстановитьПараметр("БезВалюты", Справочники.Валюты.ПустаяСсылка());
	Запр.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 100
	             |	ЦеныЗакупки.Регистратор
	             |ИЗ
	             |	РегистрСведений.ЦеныЗакупки КАК ЦеныЗакупки
	             |ГДЕ
	             |	ЦеныЗакупки.Валюта = &БезВалюты"; 
	Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Набор = РегистрыСведений.ЦеныЗакупки.СоздатьНаборЗаписей(); 
		Набор.Отбор.Регистратор.Установить(Выборка.Регистратор);
		Набор.Записать(); 
		Ном = Ном + 1;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьРС(Команда) 
	Ном = 0;
	ОчиститьРСНаСервере(Ном);
	Сообщить("Удалено наборов записей: "+Ном);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если СформироватьПриОткрытии Тогда
	   ПоказатьЦеныНаСервере();
   КонецЕсли;
   
КонецПроцедуры
