
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

    омСервер.ЗаписатьОбщиеРеквизиты(ЭтотОбъект);
    Количество = Товары.Итог("Количество");
	Сумма = Товары.Итог("Сумма");

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	ОбщегоНазначенияСервер.ЗаполнитьРеквизитыДокументаПоУмолчанию(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ТаблицаТовары = ТаблицаТовары();
	ПроверкаВозможностиПроведения(ТаблицаТовары, Отказ);

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Движения.ОстаткиТовара.Записывать 		= Истина;
	Движения.ТоварыНаКомиссии.Записывать 	= Истина;
	Движения.Продажи.Записывать 			= Истина;

	Для Каждого ТекСтрокаТовары Из ТаблицаТовары Цикл  
		
		// РН ОстаткиТовара
		Движение = Движения.ОстаткиТовара.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
		Движение.Период 		= Дата;
		Движение.Номенклатура 	= ТекСтрокаТовары.Номенклатура;
		Движение.Партия 		= ТекСтрокаТовары.Партия;
		Движение.Склад 			= СкладКомиссии;
		Движение.Фирма 			= Фирма;
		Движение.Остаток 		= ТекСтрокаТовары.Количество; 
		
		// РН ТоварыНаКомиссии
		Движение = Движения.ТоварыНаКомиссии.Добавить();
		Движение.ВидДвижения 		= ВидДвиженияНакопления.Расход; 
		Движение.Период 			= Дата;
 		Движение.Номенклатура 		= ТекСтрокаТовары.Номенклатура;
		Движение.Партия 			= ТекСтрокаТовары.Партия;
		Движение.Контрагент 		= Контрагент;
		Движение.Склад 				= СкладКомиссии;
        Движение.Количество			= ТекСтрокаТовары.Количество;
		//Движение.Сумма				= ТекСтрокаТовары.ЦенаЗакупкиСЗатратами * ТекСтрокаТовары.Количество;
		//Движение.СуммаКомиссионера 	= ТекСтрокаТовары.Сумма; 
		
		// РН Продажи
		Движение = Движения.Продажи.Добавить(); 
		Движение.Период				= Дата;
		Движение.Номенклатура		= ТекСтрокаТовары.Номенклатура;
		Движение.Партия				= ТекСтрокаТовары.Партия;
		Движение.ДокументПрихода	= ТекСтрокаТовары.ДокументПрихода;
		Движение.Покупатель			= Контрагент;
		Движение.Поставщик			= ТекСтрокаТовары.Поставщик;
		Движение.Валюта				= Валюта;
		Движение.Автор				= КемСоздан;
		Движение.Склад				= СкладКомиссии;
		Движение.Фирма				= Фирма;
		Движение.Количество			= 0;
		//Движение.Сумма				= ТекСтрокаТовары.Сумма;
		//Движение.Наценка			= ТекСтрокаТовары.Сумма - ТекСтрокаТовары.ЦенаЗакупкиСЗатратами * ТекСтрокаТовары.Количество;
		//Движение.СуммаВБазВалюте	= Движение.Сумма * К;
		//Движение.НаценкаВБазВалюте	= Движение.Наценка * К;
	КонецЦикла;


КонецПроцедуры


Процедура ПроверкаВозможностиПроведения(ТаблицаТовары, Отказ)
	
	Ошибки = Новый СписокЗначений;
	
	// Запрет незаполненных установлен в свойствах реквизитов шапки
	//ПроведениеДокументов.ПроверитьЗаполнениеРеквизитов(ЭтотОбъект, "Контрагент,Склад,СкладКомиссии,Валюта", Отказ); 
	
	ПроведениеДокументов.ПроверитьНаТолькоТовары(ТаблицаТовары, Ошибки);
	ПроведениеДокументов.ПроверитьНаОстаткиТоваров(ТаблицаТовары, МоментВремени(), СкладКомиссии, Ошибки, Фирма);
	ПроведениеДокументов.ПроверитьДубли(ТаблицаТовары, Ошибки);
	
	Для каждого Ош Из Ошибки Цикл
		Отказ = Истина;
		Сообщить(Ош.Значение);
	КонецЦикла; 
	
КонецПроцедуры

Функция ТаблицаТовары()

	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("Номенклатура",			"Номенклатура");
	СтруктураПолей.Вставить("ТипНоменклатуры",		"Номенклатура.ТипНоменклатуры");
	СтруктураПолей.Вставить("ЗапретОтгрузки",		"Номенклатура.ЗапретОтгрузки");
	СтруктураПолей.Вставить("Серия",				"Серия");
	СтруктураПолей.Вставить("Партия",				"Партия");
	СтруктураПолей.Вставить("Количество",			"Количество");
	СтруктураПолей.Вставить("Цена",					"Цена");
	СтруктураПолей.Вставить("Сумма",				"Сумма");   
	
	ЗапросТовары = ПроведениеДокументов.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураПолей);
	ТаблицаТовары = ЗапросТовары.Выгрузить();
	
    Возврат ТаблицаТовары;
	
КонецФункции 

