&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ глПриСозданииНаСервереЭлемент(ЭтаФорма, Объект) Тогда Отказ = Истина; Возврат; КонецЕсли;
	// © Primus1C  12.12.2023  НАЧАЛО ►
	Если НЕ РольДоступна("Администратор") Тогда
		Элементы.Код.ТолькоПросмотр						= Истина;
		Элементы.Наименование.ТолькоПросмотр			= Истина;
		Элементы.Префикс.ТолькоПросмотр					= Истина;
		Элементы.ГруппаПлатежныйКалендарь.ТолькоПросмотр= Истина;
	КонецЕсли;
	// © Primus1C  ОКОНЧАНИЕ ◄
КонецПроцедуры
