&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ глПриСозданииНаСервереЭлемент(ЭтаФорма, Объект) Тогда Отказ = Истина; Возврат; КонецЕсли;
	// © Primus1C  12.12.2023  НАЧАЛО ►
	Если НЕ РольДоступна("Администратор") Тогда
		Элементы.Код.ТолькоПросмотр						= Истина;
		Элементы.Наименование.ТолькоПросмотр			= Истина;
		Элементы.Префикс.ТолькоПросмотр					= Истина;
		Элементы.ГруппаПлатежныйКалендарь.ТолькоПросмотр= Истина;
	КонецЕсли;
	// © Primus1C  ОКОНЧАНИЕ ◄
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ВестиПартионныйУчет.ТолькоПросмотр = ЕстьДокументы();
КонецПроцедуры 

&НаСервере
Функция ЕстьДокументы()
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат Ложь;
	КонецЕсли;       
	
	Запр = Новый Запрос;
	Запр.Текст = "ВЫБРАТЬ первые 1
	             |	ДвижениеДенег.Ссылка КАК Ссылка
	             |ИЗ
	             |	Документ.ДвижениеДенег КАК ДвижениеДенег
	             |ГДЕ
	             |	(ДвижениеДенег.ДСчет = &Счет
	             |	Или ДвижениеДенег.СубДСчет = &Счет )
	             |	И ДвижениеДенег.Проведен";
	Запр.УстановитьПараметр("Счет", Объект.Ссылка);
	РезультатЗапроса = Запр.Выполнить();
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции 


