&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИмяДокумента = "ДвижениеДенег";
	Документы[ИмяДокумента].ЗаполнитьРеквизиты(ЭтаФорма);
	гоФормаСпискаПриСоздании(ЭтаФорма);
	
	//2015.11.24
	глПокраситьВалюты(ЭтаФорма, "Валюта");
	глПокраситьСостояние(ЭтаФорма, ИмяДокумента);
	
	//2017.03.22
	Мас = омСервер.МассивКасс();
	Если Мас.Количество() <> 0 Тогда 
		гоСтандартныйОтбор(Список, 2, Истина, Мас);
		СпиКас.ЗагрузитьЗначения(Мас);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьВсеПараметры()
	Документы[ИмяДокумента].УстановитьВсеПараметры(ЭтаФорма);
	УстановитьФирму();
	УстановитьКассу();
КонецПроцедуры

&НаСервере
Процедура УстановитьФирму(Принудительно = 0)
	Фильтр = гоФирма();
	Если НЕ (Принудительно = 0) Тогда Фильтр = Принудительно КонецЕсли; 
	
	гоСтандартныйОтбор(Список, 0, Истина, Фильтр);
КонецПроцедуры

&НаСервере
Процедура УстановитьКассу(Принудительно = 0)
	Если НЕ (Принудительно = 0) Тогда ФильтрДСчет = Принудительно КонецЕсли; 
	
	гоСтандартныйОтбор(Список, 1, ЗначениеЗаполнено(ФильтрДСчет), ФильтрДСчет);
	
	ПараметрыСеанса.ДСчет = ФильтрДСчет;
	
	//2017.03.22
	Если СпиКас.Количество() <> 0 Тогда
		Если СпиКас.НайтиПоЗначению(ФильтрДСчет) = Неопределено Тогда ОстаткиПоСчету = "?"; Возврат; КонецЕсли; КонецЕсли;
	
	СтруктураОстатков = СтруктураОстатков(ФильтрДСчет); 
	ОстаткиПоСчету = СтруктураОстатков.Строка; 
	Элементы.ДекорацияОстаткиПоСчету.Заголовок = Новый ФорматированнаяСтрока(ОбщегоНазначения.ТекстHTMLВФорматированнуюСтроку(СтруктураОстатков.ФмтСтрока)); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	гоЗаголовокИнтервал(ЭтаФорма, Ложь, Истина);
	УстановитьВсеПараметры();
	гоЖурналПриОткрытии(ЭтаФорма, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	гоЖурналПередЗакрытием(ЭтаФорма, Отказ, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	//СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ФильтрДСчетПриИзменении(Элемент)
	УстановитьКассу();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОстатки(Команда)
	
	Если СпиКас.Количество() <> 0 И СпиКас.НайтиПоЗначению(ФильтрДСчет) = Неопределено Тогда 
		ОстаткиПоСчету = "?";
		Элементы.ДекорацияОстаткиПоСчету.Заголовок = "?";
	Иначе		
		СтруктураОстатков = СтруктураОстатков(ФильтрДСчет); 
		ОстаткиПоСчету = СтруктураОстатков.Строка;
		Элементы.ДекорацияОстаткиПоСчету.Заголовок = Новый ФорматированнаяСтрока(ОбщегоНазначения.ТекстHTMLВФорматированнуюСтроку(СтруктураОстатков.ФмтСтрока)); 
	КонецЕсли;  
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СтруктураОстатков(Касса) 
	
	Если гоПЗ(Касса) Тогда 
		Результат = "?"; 
		ФмтРезультат = "?"; 
	Иначе	
		Результат = ""; 
		ФмтРезультат = ""; 
		Фильтр = Новый Структура("Фирма,Касса", Касса.Владелец, Касса);
		Табл = РегистрыНакопления.Деньги.Остатки(, Фильтр, "Валюта", "Остаток");
		Если Табл.Количество() > 0 Тогда 
			Для Каждого стрТабл Из Табл Цикл  
				Граница = Последовательности.ПартииВалют.ПолучитьГраницу(Новый Структура("Касса,Валюта", Касса, стрТабл.Валюта));		
				Если ЗначениеЗаполнено(Граница) Тогда
					СтрГраница = " (" + Граница.Дата + ")";
				Иначе	
					СтрГраница = "";
				КонецЕсли;
				гоРезСоо(Результат, гоСуммаЗнВал(стрТабл.Остаток, стрТабл.Валюта, 2) + СтрГраница, ",   ");  
				ФмтРезультат = СтрШаблон("%1%2 %3%4",
							?(ЗначениеЗаполнено(ФмтРезультат), ФмтРезультат + ",&#160;", ФмтРезультат),
							омСервер.Фрмт(стрТабл.Остаток, "ЧИСЛО_ЦВ2"), 
							омСервер.Фрмт(стрТабл.Валюта, "НАДПИСЬ_ЦВ2"),
							омСервер.Фрмт(?(ЗначениеЗаполнено(Граница), СтрШаблон(" (%1)", Формат(Граница.Дата,"ДЛФ=D")) ,""), "НАДПИСЬ_ЦВ1")
							);

			КонецЦикла; 
		КонецЕсли;  
	КонецЕсли; 
	
	Возврат Новый Структура("Строка,ФмтСтрока", Результат, ФмтРезультат);    
	
КонецФункции

